{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=1462",
    "name": "Connect the Dots",
    "source": "Advanced Player's Guide",
    "rarity": "Uncommon",
    "traits": [
        "Concentrate",
        "Investigator",
        "Secret"
    ],
    "level": 6,
    "prereq": "",
    "summary": "Ephemeral connections between people, places, and concepts are invisible to most, but seeing them is your stock and trade.",
    "description": "Ephemeral connections between people, places, and concepts are invisible to most, but seeing them is your stock and trade. You spend 10 minutes considering two different leads you're pursuing. You then attempt a check to investigate how connected the two are. Unless the GM determines otherwise, this is a Crafting check if they're both items or a Society check for other combinations of leads. If any subjects are creatures, this check usually uses the highest DC among their Deception and Will DCs. If no subjects are creatures, but at least one is an item, the DC is usually a hard DC for the level of the highest-level item. If neither case applies, the DC is usually a hard expert or hard master DC (22 or 32). Once you try to Connect the Dots between two particular leads, you can never try to Connect the Dots between those same leads again unless the GM allows it after you've learned a substantial amount of new information. \n\nCritical Success The GM tells you how connected the two leads are to one another: highly connected, somewhat connected, tangentially connected, or not connected. The GM also tells you one specific way in which they're connected, if they are.\nSuccess As critical success, but the GM doesn't tell you a specific connection.\nFailure Your results are inconclusive.\nCritical Failure You misconstrue the information. As success, but the GM provides an incorrect degree of connection.Traits\n\nConcentrate: An action with this trait requires a degree of mental concentration and discipline.\n\nSecret: The GM rolls the check for this ability in secret.Uncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.",
    "economy": "none",
    "trigger": ""
}