{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2944",
    "name": "Twin Eidolon",
    "source": "Secrets of Magic",
    "rarity": "Common",
    "traits": [
        "Polymorph",
        "Summoner",
        "Transmutation"
    ],
    "level": 20,
    "prereq": "&Mdash;",
    "summary": "You can transform to match your eidolon.",
    "description": "You can transform to match your eidolon. When you Manifest your Eidolon, you can call upon its powers to transform yourself into a duplicate until it unmanifests. You can't use this if you Manifest your Eidolon in an unusual way, such as Meld into Eidolon. While using Twin Eidolon, you use your eidolon's statistics other than your mental ability modifiers, including its evolutions. You can't cast spells (except spells your eidolon could cast), Activate or otherwise benefit from magic items that normally benefit you and not your eidolon, or use other actions it can't perform. Any of its spells you cast with limited uses count against your eidolon's uses. You can Manifest your Eidolon again to end this effect.\n\nSpecial This feat has the trait matching your eidolon's tradition (arcane, divine, occult, or primal).Traits\n\nPolymorph: These effects transform the target into a new form. A target can't be under the effect of more than one polymorph effect at a time. If it comes under the effect of a second polymorph effect, the second polymorph effect attempts to counteract the first. If it succeeds, it takes effect, and if it fails, the spell has no effect on that target. Any Strikes specifically granted by a polymorph effect are magical. Unless otherwise stated, polymorph spells don't allow the target to take on the appearance of a specific individual creature, but rather just a generic creature of a general type or ancestry.\n\n If you take on a battle form with a polymorph spell, the special statistics can be adjusted only by circumstance bonuses, status bonuses, and penalties. Unless otherwise noted, the battle form prevents you from casting spells, speaking, and using most manipulate actions that require hands. (If there's doubt about whether you can use an action, the GM decides.) Your gear is absorbed into you; the constant abilities of your gear still function, but you can't activate any items.\n\nTransmutation: Effects and magic items with this trait are associated with the transmutation school of magic, typically changing something’s form.",
    "economy": "none",
    "trigger": ""
}