{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2981",
    "name": "Stoked Flame Stance",
    "source": "Secrets of Magic",
    "rarity": "Common",
    "traits": [
        "Evocation",
        "Fire",
        "Monk",
        "Stance"
    ],
    "level": 1,
    "prereq": "&Mdash;",
    "summary": "You enter a stance of fast, fiery movements.",
    "description": "You enter a stance of fast, fiery movements. You can make flashing spark attacks that deal 1d8 slashing damage. They are in the brawling group and have the forceful, nonlethal, sweep, and unarmed traits. If you have access to the flashing sparks' critical specialization effect, you can take an alternate effect instead: if your critical Strike dealt damage, the target takes 1d6 persistent fire damage.\n\n While in Stoked Flame Stance, you gain a +5-foot status bonus to your Speed. If you have incredible movement, increase the benefit from incredible movement to a +15-foot status bonus plus 5 feet for every 4 levels beyond 3rd.\n\nSpecial This feat gains your choice of either the divine or occult trait, matching your ki spell tradition if possible.Stoked Flame Stance Leads To...\n\nBlazing Streak, Inner Fire (SoM)TraitsEvocation: Effects and magic items with this trait are associated with the evocation school of magic, typically involving energy and elemental forces.\n\nFire: Effects with the fire trait deal fire damage or either conjure or manipulate fire. Those that manipulate fire have no effect in an area without fire. Creatures with this trait consist primarily of fire or have a magical connection to that element. Planes with this trait are composed of flames that continually burn with no fuel source. Fire planes are extremely hostile to non-fire creatures.Stance: A stance is a general combat strategy that you enter by using an action with the stance trait, and that you remain in for some time. A stance lasts until you get knocked out, until its requirements (if any) are violated, until the encounter ends, or until you enter a new stance, whichever comes first. After you use an action with the stance trait, you can’t use another one for 1 round. You can enter or be in a stance only in encounter mode.",
    "economy": "1-action",
    "trigger": ""
}