{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=856",
    "name": "Train Animal",
    "source": "Core Rulebook",
    "rarity": "Common",
    "traits": [
        "Downtime",
        "General",
        "Manipulate",
        "Skill"
    ],
    "level": 1,
    "prereq": "Trained In Nature",
    "summary": "Teach an animal a trick.",
    "description": "You spend time teaching an animal to do a certain action. You can either select a basic action the animal already knows how to do (typically those listed in the Command an Animal action) or attempt to teach the animal a new basic action. The GM determines the DC of any check required and the amount of time the training takes (usually at least a week). It’s usually impossible to teach an animal a trick that uses critical thinking. If you’re expert, master, or legendary in Nature, you might be able to train more unusual creatures, at the GM’s discretion.\n\nSuccess The animal learns the action. If it was an action the animal already knew, you can Command the Animal to take that action without attempting a Nature check. If it was a new basic action, add that action to the actions the animal can take when Commanded, but you must still roll.\nFailure The animal doesn’t learn the trick.Traits\n\nDowntime: An activity with this trait takes a day or more, and can be used only during downtime.\n\nGeneral: A type of feat that any character can select, regardless of ancestry and class, as long as they meet the prerequisites. You can select a feat with this trait when your class grants a general feat.Manipulate: You must physically manipulate an item or make gestures to use an action with this trait. Creatures without a suitable appendage can’t perform actions with this trait. Manipulate actions often trigger reactions.Skill: A general feat with the skill trait improves your skills and their actions or gives you new actions for a skill. A feat with this trait can be selected when a class grants a skill feat or general feat. Archetype feats with the skill trait can be selected in place of a skill feat if you have that archetype's dedication feat.",
    "economy": "none",
    "trigger": ""
}