{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2458",
    "name": "Final Form",
    "source": "Ancestry Guide",
    "rarity": "Common",
    "traits": [
        "Concentrate",
        "Divine",
        "Evocation",
        "Morph",
        "Tiefling",
        "Transmutation"
    ],
    "level": 17,
    "prereq": "&Mdash;",
    "summary": "You embrace your monstrous blood and make it your own, screaming out to the heavens and hells alike in rage, pain, and defiance.",
    "description": "You embrace your monstrous blood and make it your own, screaming out to the heavens and hells alike in rage, pain, and defiance. Reality buckles and twists under your sudden power—each tiefling has a unique transformation, but it might include sulfurous flames, choruses of shrieks, or twisting, serpentine lightning. Every creature within 10 feet of you is deafened and dazzled for 1 round unless they succeed at a Fortitude save using your class DC or spell DC, whichever is higher. Your final form has the effects of divine vessel for a deity that shares an alignment with your fiendish lineage. Your final form resembles a creature from your fiendish lineage, and you remain in that form for 1 minute. While in your final form, you can cast chilling darkness, fireball, and lightning bolt as 6th-level divine innate spells, once each per use of this feat.\n\n When you emerge from your final form, you become drained 3. In addition, if you have this feat, you gain weakness 10 to good even when not in your final form, and you take good damage even if you aren't evil.\n\nSpecial At the GM's discretion, the specific elements of this feat can be adjusted to better fit the tiefling's lineage—for example, a GM might decide that a particular beastbrood tiefling could cast a 6th-level phantasmal killer instead of fireball.Traits\n\nConcentrate: An action with this trait requires a degree of mental concentration and discipline.\n\nDivine: This magic comes from the divine tradition, drawing power from deities or similar sources. Anything with this trait is magical.Evocation: Effects and magic items with this trait are associated with the evocation school of magic, typically involving energy and elemental forces.Morph: Effects that slightly alter a creature's form have the morph trait. Any Strikes specifically granted by a morph effect are magical. You can be affected by multiple morph spells at once, but if you morph the same body part more than once, the second morph effect attempts to counteract the first (in the same manner as two polymorph effects, described in that trait).\n\nYour morph effects might also end if you are polymorphed and the polymorph effect invalidates or overrides your morph effect. The GM determines which morph effects can be used together and which can't.Tiefling: A creature with this trait has the tiefling versatile heritage. Tieflings are planar scions descended from fiends. An ability with this trait can be used or selected only by tieflings.Transmutation: Effects and magic items with this trait are associated with the transmutation school of magic, typically changing something’s form.",
    "economy": "3-action",
    "trigger": ""
}