{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=1940",
    "name": "Dragon Disciple Dedication",
    "source": "Advanced Player's Guide",
    "rarity": "Uncommon",
    "traits": [
        "Archetype",
        "Dedication"
    ],
    "level": 2,
    "prereq": "&Mdash;",
    "summary": "You choose to study or worship one type of dragon, and your focus grants you a measure of its power.",
    "description": "You choose to study or worship one type of dragon, and your focus grants you a measure of its power. You become trained in arcane spell DCs and arcane spell attack rolls. Choose one color of dragon when you select this feat; if you are a sorcerer with the draconic bloodline, this must be the same type as your bloodline. You gain resistance equal to half your level against one type of damage determined by the chosen dragon type. The GM may allow you to choose a dragon type not listed below, and will determine the damage type appropriate for that dragon.Black, Brine*, or Copper AcidBlue, Bronze, Cloud*, or Sky* ElectricityBrass, Gold, Magma*, Red, or Underworld* FireCrystal* or Forest* PiercingGreen PoisonSea* BludgeoningSilver or White ColdSovereign* Mental Umbral* Negative\n*Source Mwangi Expanse pg. 76You also gain a +1 circumstance bonus to saving throws against sleep effects and effects that would make you paralyzed.\n\nSpecial You can't select another dedication feat until you have gained two other feats from the dragon disciple archetype. If you later take the sorcerer archetype, you must choose the draconic bloodline.Dragon Disciple Dedication Leads To...\n\nBreath of the Dragon, Claws of the Dragon, Cloud Walk, Deflecting Cloud, Disciple's Breath, Draconic Scent, Dragon Arcana, Mighty Wings, Scales of the Dragon, Shape of the Cloud Dragon, Shape of the Dragon, Wings of the DragonTraitsArchetype: This feat belongs to an archetype.\n\nDedication: You must select a feat with this trait to apply an archetype to your character.Uncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.",
    "economy": "none",
    "trigger": ""
}