{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=1830",
    "name": "Terraforming Spell",
    "source": "Advanced Player's Guide",
    "rarity": "Common",
    "traits": [
        "Concentrate",
        "Earth",
        "Metamagic",
        "Sorcerer",
        "Transmutation"
    ],
    "level": 16,
    "prereq": "&Mdash;",
    "summary": "You capture transformative fragments of magic and slam them into the ground, creating a shock wave that alters your surroundings.",
    "description": "You capture transformative fragments of magic and slam them into the ground, creating a shock wave that alters your surroundings. If your next action is to Cast a non-cantrip transmutation Spell, either each space adjacent to you becomes difficult terrain, or each space adjacent to you is no longer difficult terrain. This doesn't have any effect on greater difficult terrain and doesn't remove the damaging effects of hazardous terrain.Traits\n\nConcentrate: An action with this trait requires a degree of mental concentration and discipline.\n\nEarth: Effects with the earth trait either manipulate or conjure earth. Those that manipulate earth have no effect in an area without earth. Creatures with this trait consist primarily of earth or have a magical connection to that element. Planes with this trait are mostly solid, with caverns and other hollow pockets.Metamagic: Actions with the metamagic trait, usually from metamagic feats, tweak the properties of your spells. You must use a metamagic action directly before Casting the Spell you want to alter. If you use any action (including free actions and reactions) other than Cast a Spell directly after, you waste the benefits of the metamagic action. Any additional effects added by a metamagic action are part of the spell’s effect, not of the metamagic action itself.Transmutation: Effects and magic items with this trait are associated with the transmutation school of magic, typically changing something’s form.",
    "economy": "1-action",
    "trigger": ""
}