{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2123",
    "name": "Disturbing Knowledge",
    "source": "Advanced Player's Guide",
    "rarity": "Common",
    "traits": [
        "Emotion",
        "Fear",
        "General",
        "Mental",
        "Skill"
    ],
    "level": 7,
    "prereq": "Master In Occultism",
    "summary": "Frighten foes with occult secrets.",
    "description": "You utter a litany of dreadful names, prophecies, and descriptions of realms beyond mortal comprehension, drawn from your study of forbidden tomes and scrolls. Even those who don't understand your language are unsettled by these dire secrets. Attempt an Occultism check and compare the result to the Will DC of an enemy within 30 feet, or to the Will DCs of any number of enemies within 30 feet if you are legendary in Occultism. Those creatures are temporarily immune for 24 hours.\n\nCritical Success The target becomes confused for 1 round and frightened 1.\nSuccess The target becomes frightened 1.\nFailure The target is unaffected.\nCritical Failure You get overly caught up in your own words and become frightened 1.Traits\n\nEmotion: This effect alters a creature's emotions. Effects with this trait always have the mental trait as well. Creatures with special training or that have mechanical or artificial intelligence are immune to emotion effects.\n\nFear: Fear effects evoke the emotion of fear. Effects with this trait always have the mental and emotion traits as well.General: A type of feat that any character can select, regardless of ancestry and class, as long as they meet the prerequisites. You can select a feat with this trait when your class grants a general feat.Mental: A mental effect can alter the target's mind. It has no effect on an object or a mindless creature.Skill: A general feat with the skill trait improves your skills and their actions or gives you new actions for a skill. A feat with this trait can be selected when a class grants a skill feat or general feat. Archetype feats with the skill trait can be selected in place of a skill feat if you have that archetype's dedication feat.",
    "economy": "2-action",
    "trigger": ""
}