{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2158",
    "name": "Artokus's Fire",
    "source": "Legends",
    "rarity": "Rare",
    "traits": [
        "Additive 2",
        "Alchemist"
    ],
    "level": 6,
    "prereq": "&Mdash;",
    "summary": "Artokus developed a mixture of volatile materials that burns hotter and longer than typical alchemist's fire.",
    "description": "Artokus developed a mixture of volatile materials that burns hotter and longer than typical alchemist's fire. You include this additive mixture when crafting your alchemist's fire. The alchemist's fire deals 1d4 persistent fire damage in addition to what the alchemist fire would normally cause (for instance, a moderate alchemist's fire deals 1d4+2 persistent fire damage). A creature taking persistent fire damage from the alchemist's fire requires two successful flat checks to end the persistent damage, or one check if the creature had an assisted recovery that reduces the flat check to DC 10. The enhanced alchemist's fire burns even underwater, and any attempts to end the persistent damage by using water have no effect.\nTraits\n\nAdditive 2: Feats with the additive trait allow you to spend actions to add special substances to bombs or elixirs. You can add only one additive to a single alchemical item, and attempting to add another spoils the item. You can typically use actions with the additive trait only when you're creating an infused alchemical item, and some can be used only with the Quick Alchemy action. The additive trait is always followed by a level, such as additive 2. An additive adds its level to the level of the alchemical item you're modifying; the result is the new level of the mixture. The mixture's item level must be no higher than your advanced alchemy level.\n\nRare: This rarity indicates that a rules element is very difficult to find in the game world. A rare feat, spell, item or the like is available to players only if the GM decides to include it in the game, typically through discovery during play. Creatures with this trait are rare. They typically can't be summoned. The DC of Recall Knowledge checks related to these creatures is increased by 5.Artokus's DiscoveriesSource Legends pg. 20\nArtokus Kirran's legacy includes far more than just the sun orchid elixir. As one of the longest-lived alchemists in Golarion, he's developed a number of other significant alchemical discoveries known across the Inner Sea region. The following are some of his more notable discoveries. Artokus is cautious about sharing his alchemical techniques and typically only does so with his most trusted students.\n\nRelated Feats: Wish Alchemy",
    "economy": "free_action",
    "trigger": "You use Quick Alchemy to craft an alchemist's fire, and that bomb's level is at least 2 levels lower than your advanced alchemy level."
}