{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2297",
    "name": "Radiate Glory",
    "source": "Ancestry Guide",
    "rarity": "Common",
    "traits": [
        "Aasimar",
        "Divine",
        "Evocation",
        "Light",
        "Visual"
    ],
    "level": 17,
    "prereq": "",
    "summary": "Your inherent glory radiates into the world with all the divine power of the celestial planes for 1 minute.",
    "description": "Your inherent glory radiates into the world with all the divine power of the celestial planes for 1 minute. Any creature that can see you while you Radiate Glory must attempt a Will saving throw against your class DC or spell DC, whichever is higher. The creature then becomes temporarily immune to this effect for 24 hours.\n\nCritical Success The creature is unaffected.\nSuccess You are concealed to the creature for 1 round by the shining light, but can't use this concealment to Hide, as normal for when your location is obvious.\nFailure As success, except you are concealed to the creature while your glory radiates.\nCritical Failure You are hidden to the creature while your glory radiates, lost amid the radiant corona of your presence. Your general position is still obvious, so you can't use this to Sneak.Traits\n\nAasimar: A creature with this trait has the aasimar versatile heritage. Aasimars are planar scions descended from celestial beings. An ability with this trait can be used or selected only by aasimars.\n\nDivine: This magic comes from the divine tradition, drawing power from deities or similar sources. Anything with this trait is magical.Evocation: Effects and magic items with this trait are associated with the evocation school of magic, typically involving energy and elemental forces.Light: Light effects overcome non-magical darkness in the area, and can counteract magical darkness. You must usually target darkness magic with your light magic directly to counteract the darkness, but some light spells automatically attempt to counteract darkness.Visual: A visual effect can affect only creatures that can see it. This applies only to visible parts of the effect, as determined by the GM.",
    "economy": "1-action",
    "trigger": ""
}