{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3443",
    "name": "Mammoth Lord Dedication",
    "source": "Pathfinder #177",
    "rarity": "Uncommon",
    "traits": [
        "Archetype",
        "Dedication"
    ],
    "level": 4,
    "prereq": "Ride",
    "summary": "You've undertaken the ultimate challenge of the Mammoth Lords and tamed a megafauna.",
    "description": "You've undertaken the ultimate challenge of the Mammoth Lords and tamed a megafauna. You gain a megafauna you tamed as a young animal companion. Your megafauna animal companion must be a megafauna appropriate to the Realm of the Mammoth Lords; see the What Counts as Megafauna? sidebar for guidance and examples. While an animal companion usually starts as Small, you can begin with a Medium version of that animal (changing no statistics other than its size).\n\n Contrary to the usual rules for animal companions, this feat can give you a second animal companion. If you have more than one animal companion, you can adventure with only one of them at a time. You can switch between them like a beastmaster does. You gain the Call Companion action, as the beastmaster archetype, and you follow all the other rules found in the Call Companion sidebar.\n\nSpecial You can't select another dedication feat until you've gained two other feats from this archetype.Mammoth Lord Dedication Leads To...Gigantic Megafauna Companion, Mammoth Charge, Mature Megafauna Companion, Megafauna Veterinarian, Specialized Megafauna Companion, Speech of the Mammoth Lords, Staggering Blow, Stalwart Mind, Unbreakable BondTraitsArchetype: This feat belongs to an archetype.\n\nDedication: You must select a feat with this trait to apply an archetype to your character.Uncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.",
    "economy": "none",
    "trigger": ""
}