{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2310",
    "name": "Hydraulic Maneuvers",
    "source": "Ancestry Guide",
    "rarity": "Common",
    "traits": [
        "Azarketi",
        "Concentrate",
        "Manipulate",
        "Primal",
        "Transmutation",
        "Water"
    ],
    "level": 13,
    "prereq": "",
    "summary": "You batter your foes with a torrent of water siphoned from your surroundings.",
    "description": "You batter your foes with a torrent of water siphoned from your surroundings. If the next action you take is an Athletics check to Disarm, Shove, or Trip, that action has a range of 15 feet. You don't receive any item bonuses to that check or any circumstance bonuses related to your physical body, but if you roll a critical failure on that Athletics check, you get a failure instead.Traits\n\nAzarketi: Amphibious humanoids who live among the seas of the Inner Sea region, said to have descended from the people of Azlant. Sometimes known as gillmen or Low Azlanti.\n\nAzarketis craft and use these weapons.\n\nConcentrate: An action with this trait requires a degree of mental concentration and discipline.Manipulate: You must physically manipulate an item or make gestures to use an action with this trait. Creatures without a suitable appendage can’t perform actions with this trait. Manipulate actions often trigger reactions.Primal: This magic comes from the primal tradition, connecting to the natural world and instinct. Anything with this trait is magical.Transmutation: Effects and magic items with this trait are associated with the transmutation school of magic, typically changing something’s form.Water: Effects with the water trait either manipulate or conjure water. Those that manipulate water have no effect in an area without water. Creatures with this trait consist primarily of water or have a magical connection to the element. Planes with this trait are mostly liquid, perhaps with pockets of breathable air.",
    "economy": "1-action",
    "trigger": ""
}