{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=857",
    "name": "Trick Magic Item",
    "source": "Core Rulebook",
    "rarity": "Common",
    "traits": [
        "General",
        "Manipulate",
        "Skill"
    ],
    "level": 1,
    "prereq": "Trained In Arcana, Nature, Trained In Occultism, Or Trained In Religion",
    "summary": "Activate a magic item you normally can't activate.",
    "description": "You examine a magic item you normally couldn’t use in an effort to fool it and activate it temporarily. For example, this might allow a fighter to cast a spell from a wand or allow a wizard to cast a spell that’s not on the arcane list using a scroll. You must know what activating the item does, or you can’t attempt to trick it.\n\n Attempt a check using the skill matching the item’s magic tradition, or matching a tradition that has the spell on its list, if you’re trying to cast a spell from the item. The relevant skills are Arcana for arcane, Nature for primal, Occultism for occult, Religion for divine, or any of the four for an item that has the magical trait and not a tradition trait. The GM determines the DC based on the item’s level (possibly adjusted depending on the item or situation).\n\n If you activate a magic item that requires a spell attack roll or spell DC and you don’t have the ability to cast spells of the relevant tradition, use your level as your proficiency bonus and the highest of your Intelligence, Wisdom, or Charisma modifiers. If you’re a master in the appropriate skill for the item’s tradition, you instead use the trained proficiency bonus, and if you’re legendary, you instead use the expert proficiency bonus.\n\nSuccess For the rest of the current turn, you can spend actions to activate the item as if you could normally use it.\nFailure You can’t use the item or try to trick it again this turn, but you can try again on subsequent turns.\nCritical Failure You can’t use the item, and you can’t try to trick it again until your next daily preparations.Traits\n\nGeneral: A type of feat that any character can select, regardless of ancestry and class, as long as they meet the prerequisites. You can select a feat with this trait when your class grants a general feat.\n\nManipulate: You must physically manipulate an item or make gestures to use an action with this trait. Creatures without a suitable appendage can’t perform actions with this trait. Manipulate actions often trigger reactions.Skill: A general feat with the skill trait improves your skills and their actions or gives you new actions for a skill. A feat with this trait can be selected when a class grants a skill feat or general feat. Archetype feats with the skill trait can be selected in place of a skill feat if you have that archetype's dedication feat.",
    "economy": "1-action",
    "trigger": ""
}