{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2029",
    "name": "Treat Condition",
    "source": "Advanced Player's Guide",
    "rarity": "Common",
    "traits": [
        "Archetype",
        "Healing",
        "Manipulate",
        "Skill"
    ],
    "level": 4,
    "prereq": "Medic Dedication",
    "summary": "You treat an adjacent creature in an attempt to reduce the clumsy, enfeebled, or sickened condition.",
    "description": "You treat an adjacent creature in an attempt to reduce the clumsy, enfeebled, or sickened condition. If a creature has multiple conditions from this list, choose one. Attempt a counteract check against the condition, using your Medicine modifier as your counteract modifier and the condition's source to determine the DC. You can't treat a condition that came from an artifact or effect above 20th level unless you have Legendary Medic; even if you do, the counteract DC increases by 10. Treating a Condition that is continually applied under certain circumstances (for instance, the enfeebled condition a good character gains from carrying an unholy weapon) has no effect as long as the circumstances continue.\n\nCritical Success Reduce the condition value by 2.\nSuccess Reduce the condition value by 1.\nCritical Failure Increase the condition value by 1.Treat Condition Leads To...\n\nHolistic Care, Preventative TreatmentTraitsArchetype: This feat belongs to an archetype.\n\nHealing: A healing effect restores a creature's body, typically by restoring Hit Points, but sometimes by removing diseases or other debilitating effects.Manipulate: You must physically manipulate an item or make gestures to use an action with this trait. Creatures without a suitable appendage can’t perform actions with this trait. Manipulate actions often trigger reactions.Skill: A general feat with the skill trait improves your skills and their actions or gives you new actions for a skill. A feat with this trait can be selected when a class grants a skill feat or general feat. Archetype feats with the skill trait can be selected in place of a skill feat if you have that archetype's dedication feat.",
    "economy": "2-action",
    "trigger": ""
}