{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3557",
    "name": "Zombie Dedication",
    "source": "Book of the Dead",
    "rarity": "Rare",
    "traits": [
        "Archetype",
        "Dedication"
    ],
    "level": 2,
    "prereq": "You Died And Were Animated As A Husk Zombie.",
    "summary": "Despite your death and subsequent reanimation as a rotting corpse, you retain most of your mind and identity.",
    "description": "Despite your death and subsequent reanimation as a rotting corpse, you retain most of your mind and identity. Yet, it's always there: the hunger for the flesh and organs of the living. You gain the undead and zombie traits, and the basic undead benefits. Unlike a typical zombie, you're not mindless. Reduce all your Speeds by 5 feet. Your fist loses the nonlethal trait.\n\n Because of its progressing state of decay, your body requires continual maintenance to remain at its best. Each day after your rest period, your body is deteriorated due to natural decay. Additionally, some zombie abilities allow you to push for a greater effect in exchange for a chance of deteriorating your body.\n\n While your body is deteriorated, you're slowed 1. You can spend 10 minutes checking and repairing your joints and other weak parts of your body to recover from deterioration. You can perform these repairs as part of your daily preparations. Because it's a natural result of your body's functions, you can't remove the slowed condition from deterioration through any other means.\n\n You crave the flesh of the living. You gain a jaws unarmed attack that deals 1d8 piercing damage. Your jaws are in the brawling group and have the unarmed trait. You can use your jaws Strike only against a creature that's grabbed or restrained by you.\n\nSpecial You can't select another dedication feat until you have gained two other feats from the zombie archetype.Zombie Dedication Leads To...\n\nAnkle Biter, Feast, Festering Wound, Numb, Out of Hand, Ravenous Charge, Seize, Shamble, UnkillableTraitsArchetype: This feat belongs to an archetype.\n\nDedication: You must select a feat with this trait to apply an archetype to your character.Rare: This rarity indicates that a rules element is very difficult to find in the game world. A rare feat, spell, item or the like is available to players only if the GM decides to include it in the game, typically through discovery during play. Creatures with this trait are rare. They typically can't be summoned. The DC of Recall Knowledge checks related to these creatures is increased by 5.",
    "economy": "none",
    "trigger": ""
}