{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=1240",
    "name": "Annihilating Swing",
    "source": "Pathfinder #156",
    "rarity": "Uncommon",
    "traits": [
        "Barbarian"
    ],
    "level": 20,
    "prereq": "&Mdash;",
    "summary": "You have learned from the brute destructive power of xulgaths and their kind.",
    "description": "You have learned from the brute destructive power of xulgaths and their kind. You make a melee Strike that ignores any resistances the target has. If you target a solid unattended object or surface with your Strike, you might automatically destroy it without an attack roll. If you target any object or surface with Hardness 20 or less that isn't a magic item or the effect of a spell, you destroy it. If the target object or surface is a magic item or the effect of a spell, you attempt to counteract it using your attack bonus with the Strike for the counteract check. On a successful counteract check, you destroy the object or surface unless it has Hardness greater than 20, is an artifact, or is similarly difficult to destroy. You destroy up to a 5-foot cube of an object or surface larger than Medium.TraitsUncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.\n\nCapstone FeatsSource Pathfinder #156: The Apocalypse Prophet pg. 72\nCharacters who have reached 20th level can choose from the following feats, representing the pinnacle of mortal power influenced by their triumphs.\n\nRelated Feats: Astonishing Explosion, Banishing Blow, Denier of Destruction, Endurance of the Rooted Tree, Mimic Protections, Reclaim Spell, Reflecting Riposte, Ringmaster's Introduction, Steal Essence, Tenacious Blood Magic, Verdant Presence",
    "economy": "2-action",
    "trigger": ""
}