{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3414",
    "name": "Pactbound Dedication",
    "source": "Monsters of Myth",
    "rarity": "Rare",
    "traits": [
        "Archetype",
        "Dedication"
    ],
    "level": 2,
    "prereq": "Erutaki Or Giant Language, Must Have Earned The Trust Of A Saumen Kar Who Initiates You Into The Archetype; Trained In Nature",
    "summary": "You befriended one of the last saumen kar and were infused with a fraction of their power, granting you the potential to become a guardian of their ancient pact.",
    "description": "You befriended one of the last saumen kar and were infused with a fraction of their power, granting you the potential to become a guardian of their ancient pact. You gain cold resistance equal to half your level. You can Hide and Sneak while it's snowing even lightly, even if it wouldn't be thick enough to normally grant concealment. Finally, all saumen kar can sense the mark of their pact upon you, and their attitude toward you is typically one step better than it would be otherwise (hostile to unfriendly, unfriendly to indifferent, etc.) Most saumen kar are unfriendly to outsiders; this would make them indifferent to you.\n\nSpecial You can't select another dedication feat until you've gained two other feats from the pactbound initiate archetype.Pactbound Dedication Leads To...\n\nCrown of the Saumen Kar, Frostbite Runes, Ice CrafterTraitsArchetype: This feat belongs to an archetype.\n\nDedication: You must select a feat with this trait to apply an archetype to your character.Rare: This rarity indicates that a rules element is very difficult to find in the game world. A rare feat, spell, item or the like is available to players only if the GM decides to include it in the game, typically through discovery during play. Creatures with this trait are rare. They typically can't be summoned. The DC of Recall Knowledge checks related to these creatures is increased by 5.",
    "economy": "none",
    "trigger": ""
}