{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3054",
    "name": "Searing Restoration",
    "source": "Guns & Gears",
    "rarity": "Common",
    "traits": [
        "Fire",
        "Healing",
        "Inventor",
        "Manipulate",
        "Unstable"
    ],
    "level": 2,
    "prereq": "",
    "summary": "They told you there was no way that explosions could heal people, but they were fools… Fools who didn't understand your brilliance! You create a minor explosion from your innovation, altering the combustion to cauterize wounds using vaporized medicinal herbs.",
    "description": "They told you there was no way that explosions could heal people, but they were fools… Fools who didn't understand your brilliance! You create a minor explosion from your innovation, altering the combustion to cauterize wounds using vaporized medicinal herbs. You or a living creature adjacent to you regains 1d10 Hit Points. In addition, the creature you heal can attempt an immediate flat check to recover from a single source of persistent bleed damage, with the DC reduction from appropriate assistance.\n\n At 3rd level, and every 2 levels thereafter, increase the healing by 1d10.\n\nSpecial If your innovation is a minion, it can take this action rather than you, though because it's not a living creature, it can't use the ability on itself.Traits\n\nFire: Effects with the fire trait deal fire damage or either conjure or manipulate fire. Those that manipulate fire have no effect in an area without fire. Creatures with this trait consist primarily of fire or have a magical connection to that element. Planes with this trait are composed of flames that continually burn with no fuel source. Fire planes are extremely hostile to non-fire creatures.\n\nHealing: A healing effect restores a creature's body, typically by restoring Hit Points, but sometimes by removing diseases or other debilitating effects.Manipulate: You must physically manipulate an item or make gestures to use an action with this trait. Creatures without a suitable appendage can’t perform actions with this trait. Manipulate actions often trigger reactions.Unstable: Unstable actions use experimental applications of your innovation that even you can't fully predict, and that are hazardous to your innovation (and potentially you). When you take an unstable action, attempt a DC 17 flat check immediately after applying its effects. On a failure, the innovation malfunctions in a spectacular (though harmless) fashion, such as a belch of smoke or shower of sparks, and it becomes incapable of being used for further unstable actions. On a critical failure, you also take an amount of fire damage equal to your level. As the innovation's creator, you can spend 10 minutes retuning your innovation and making adjustments to return it to functionality, at which point you can use unstable actions with that innovation again.\n\n To take an unstable action, you must be using your innovation (for example, wearing an armor innovation or wielding a weapon innovation). If you have a minion innovation, some unstable actions are taken by the minion instead of you. In these cases, only the minion can take that action, and the minion needs to have been Commanded that turn to take the action. If you critically fail the flat check, the minion takes the damage instead of you.\n\n Some actions have an Unstable Function entry, which you can use to add the unstable trait for a bigger benefit. If you're unable to use unstable actions, you can still use the action normally, but you can't use the unstable function.",
    "economy": "1-action",
    "trigger": ""
}