{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3289",
    "name": "Crafter's Instinct",
    "source": "Guns & Gears",
    "rarity": "Uncommon",
    "traits": [
        "Dwarf",
        "Fortune"
    ],
    "level": 13,
    "prereq": "Master In Crafting",
    "summary": "You sense a minor flaw in the weapon as you fire it, and quickly adjust your aim on the fly to avoid the flaw.",
    "description": "You sense a minor flaw in the weapon as you fire it, and quickly adjust your aim on the fly to avoid the flaw. If the triggering Strike was a misfire, you get a normal failure instead. If the triggering Strike was a failure, it becomes a glancing blow that deals minimum damage for the Strike (adding any bonuses as normal but getting a result of 1 for all damage dice that would be rolled on a success). The glancing blow does not apply other effects that would normally happen only on a hit.Traits\n\nDwarf: A creature with this trait is a member of the dwarf ancestry. Dwarves are stout folk who often live underground and typically have darkvision. An ability with this trait can be used or selected only by dwarves. An item with this trait is created and used by dwarves.\n\nFortune: A fortune effect beneficially alters how you roll your dice. You can never have more than one fortune effect alter a single roll. If multiple fortune effects would apply, you have to pick which to use. If a fortune effect and a misfortune effect would apply to the same roll, the two cancel each other out, and you roll normally.Uncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.",
    "economy": "reaction",
    "trigger": "You misfire with a firearm or you roll a failure on a Strike with a ranged weapon."
}