{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3267",
    "name": "Spellshot Dedication",
    "source": "Guns & Gears",
    "rarity": "Uncommon",
    "traits": [
        "Archetype",
        "Class",
        "Dedication"
    ],
    "level": 2,
    "prereq": "Way Of The Spellshot",
    "summary": "You've steeped yourself in magic and gunplay to the extent that you can conjure bullets from thin air.",
    "description": "You've steeped yourself in magic and gunplay to the extent that you can conjure bullets from thin air, using a rudimentary knowledge of arcane theory to create a temporary piece of ammunition. You gain the Conjure Bullet action.\n\n Conjure Bullet     (conjuration, magical) Frequency once per round; Effect You conjure an ordinary level-0 bolt or bullet out of thin air and then immediately Interact to load it into your weapon. If the bolt or bullet isn't fired before the end of your turn, the effect is wasted.\n\nSpecial You can't select another dedication feat other than Beast Gunner Dedication until you've gained two other feats from the spellshot or beast gunner archetypes.Spellshot Dedication Leads To...\n\nBlack Powder Embodiment, Call Gun, Fulminating Shot, Phase BulletTraitsArchetype: This feat belongs to an archetype.\n\nClass: Archetypes with the class trait fundamentally diverge from your class's specialties but still fit within the theme of your class.\n\n You can select a class archetype only if your class meets the criteria listed in the archetype's prerequisites. Class archetypes always alter or replace some of a class's static class features in addition to any new feats they offer.\n\n It might be possible to take a class archetype at 1st level if it alters or replaces some of the class's initial class features. The 1st-level ability is presented much like a class feature and includes the class archetype's prerequisites and rules on how it changes your class. If you select this ability, you must take that archetype's dedication feat at 2nd level, and you proceed normally afterward. You can never have more than one class archetype.Dedication: You must select a feat with this trait to apply an archetype to your character.Uncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.",
    "economy": "1-action",
    "trigger": ""
}