{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=1241",
    "name": "Astonishing Explosion",
    "source": "Pathfinder #156",
    "rarity": "Uncommon",
    "traits": [
        "Additive 2",
        "Alchemist"
    ],
    "level": 20,
    "prereq": "",
    "summary": "Your bomb incorporates an explosive spark of wonder that leaves witnesses dumbfounded.",
    "description": "Your bomb incorporates an explosive spark of wonder that leaves witnesses dumbfounded. Any target hit by your Strike with the bomb is fascinated by you for 1 round. On a critical success, the target is also stunned 1.TraitsAdditive 2: Feats with the additive trait allow you to spend actions to add special substances to bombs or elixirs. You can add only one additive to a single alchemical item, and attempting to add another spoils the item. You can typically use actions with the additive trait only when you're creating an infused alchemical item, and some can be used only with the Quick Alchemy action. The additive trait is always followed by a level, such as additive 2. An additive adds its level to the level of the alchemical item you're modifying; the result is the new level of the mixture. The mixture's item level must be no higher than your advanced alchemy level.\n\nUncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.Capstone FeatsSource Pathfinder #156: The Apocalypse Prophet pg. 72\nCharacters who have reached 20th level can choose from the following feats, representing the pinnacle of mortal power influenced by their triumphs.\n\nRelated Feats: Annihilating Swing, Banishing Blow, Denier of Destruction, Endurance of the Rooted Tree, Mimic Protections, Reclaim Spell, Reflecting Riposte, Ringmaster's Introduction, Steal Essence, Tenacious Blood Magic, Verdant Presence",
    "economy": "free_action",
    "trigger": "You use Quick Alchemy to craft an alchemical bomb that deals splash damage and is at least 2 levels lower than your advanced alchemy level."
}