{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=1934",
    "name": "Command Attention",
    "source": "Advanced Player's Guide",
    "rarity": "Common",
    "traits": [
        "Archetype",
        "Auditory",
        "Emotion",
        "Enchantment",
        "Mental",
        "Visual"
    ],
    "level": 10,
    "prereq": "Celebrity Dedication",
    "summary": "You command the attention of all around you with style, ensuring their gaze falls only upon you until the end of your next turn.",
    "description": "You command the attention of all around you with style, ensuring their gaze falls only upon you until the end of your next turn. When creatures within 30 feet of you attempt saving throws against other visual effects, they use the outcome for one degree of success better than the result they rolled. An enemy within the area attempting to use a visual effect that involves focusing its attention on a particular creature (such as a medusa's Focus Gaze) must succeed at a Will save against your class DC or spell DC, whichever is higher, in order to target any creature except you. Allies in the area can attempt to Hide even if they don't have cover, as you are continually providing a distraction.Traits\n\nArchetype: This feat belongs to an archetype.\n\nAuditory: Auditory actions and effects rely on sound. An action with the auditory trait can be successfully performed only if the creature using the action can speak or otherwise produce the required sounds. A spell or effect with the auditory trait has its effect only if the target can hear it. This applies only to sound-based parts of the effect, as determined by the GM. This is different from a sonic effect, which still affects targets who can't hear it (such as deaf targets) as long as the effect itself makes sound.Emotion: This effect alters a creature's emotions. Effects with this trait always have the mental trait as well. Creatures with special training or that have mechanical or artificial intelligence are immune to emotion effects.Enchantment: Effects and magic items with this trait are associated with the enchantment school of magic, typically involving mind control, emotion alteration, and other mental effects.Mental: A mental effect can alter the target's mind. It has no effect on an object or a mindless creature.Visual: A visual effect can affect only creatures that can see it. This applies only to visible parts of the effect, as determined by the GM.",
    "economy": "1-action",
    "trigger": ""
}