{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2165",
    "name": "Vernai Training",
    "source": "Legends",
    "rarity": "Rare",
    "traits": [
        "Archetype"
    ],
    "level": 12,
    "prereq": "Achaekek's Grip; Advanced Red Mantis Magic",
    "summary": "To resurrect a creature you've slain, a spellcaster must counteract your influence on its death.",
    "description": "To resurrect a creature you've slain, a spellcaster must counteract your influence on its death. The DC of this check is equal to your class DC or spell DC, whichever is higher. In addition, add two 5th-level spells to your Red Mantis assassin spellbook—both spells must be chosen from the following options: death ward, drop dead, false vision, hallucination, illusory scene, mind probe, or sending. You gain a 5th-level spell slot that you can use to prepare a spell from your Red Mantis assassin spellbook.\nTraits\n\nArchetype: This feat belongs to an archetype.\n\nRare: This rarity indicates that a rules element is very difficult to find in the game world. A rare feat, spell, item or the like is available to players only if the GM decides to include it in the game, typically through discovery during play. Creatures with this trait are rare. They typically can't be summoned. The DC of Recall Knowledge checks related to these creatures is increased by 5.Secrets of the VernaiSource Legends pg. 57\nThe Red Mantis Assassin archetype appears on page 71 of the Lost Omens World Guide. Of the additional options below, only Prayer Attack is available freely to Red Mantis assassins without prior permission from the Blood Mistress. Those who dare learn these rare abilities without her permission run the risk of being cast out of the society and hunted down by their former allies. In theory, a daring infiltration of the Crimson Citadel could allow one to study hidden texts and learn these techniques, but the chambers within and below this fortress are among the most dangerous in the region, so such an attempt should not be made lightly!\n\nRelated Feats: Achaekek's Grip, Fading, Prayer Attack",
    "economy": "none",
    "trigger": ""
}