{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3060",
    "name": "Clockwork Celerity",
    "source": "Guns & Gears",
    "rarity": "Common",
    "traits": [
        "Inventor",
        "Manipulate",
        "Unstable"
    ],
    "level": 6,
    "prereq": "Armor, Construct, Or Weapon Innovation",
    "summary": "You can use unstable clockwork devices in your innovation to push your invention to act more quickly.",
    "description": "You can use unstable clockwork devices in your innovation to push your invention to act more quickly. You are quickened for this turn. How you can use the extra action depends on your innovation. Armor You can use the extra action to Step, Stride, or use another movement action granted by your innovation (such as Swim if you have the Diving Armor feat).Construct You can use the extra action to Command your construct innovation (or to provide 1 of the actions if you spend 2 actions to Command your construct).Weapon You can use the extra action to Strike with your innovation or Reload your innovation.Traits\n\nManipulate: You must physically manipulate an item or make gestures to use an action with this trait. Creatures without a suitable appendage can’t perform actions with this trait. Manipulate actions often trigger reactions.\n\nUnstable: Unstable actions use experimental applications of your innovation that even you can't fully predict, and that are hazardous to your innovation (and potentially you). When you take an unstable action, attempt a DC 17 flat check immediately after applying its effects. On a failure, the innovation malfunctions in a spectacular (though harmless) fashion, such as a belch of smoke or shower of sparks, and it becomes incapable of being used for further unstable actions. On a critical failure, you also take an amount of fire damage equal to your level. As the innovation's creator, you can spend 10 minutes retuning your innovation and making adjustments to return it to functionality, at which point you can use unstable actions with that innovation again.\n\n To take an unstable action, you must be using your innovation (for example, wearing an armor innovation or wielding a weapon innovation). If you have a minion innovation, some unstable actions are taken by the minion instead of you. In these cases, only the minion can take that action, and the minion needs to have been Commanded that turn to take the action. If you critically fail the flat check, the minion takes the damage instead of you.\n\n Some actions have an Unstable Function entry, which you can use to add the unstable trait for a bigger benefit. If you're unable to use unstable actions, you can still use the action normally, but you can't use the unstable function.",
    "economy": "free_action",
    "trigger": "Your turn begins."
}