{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3584",
    "name": "Vigilant Benediction",
    "source": "Knights of Lastwall",
    "rarity": "Common",
    "traits": [
        "Archetype"
    ],
    "level": 12,
    "prereq": "Knight Vigilant; Alignment Permitted By The Chosen Deity",
    "summary": "Unwilling to be outdone by the Crimson Reclaimers and their oath, you've petitioned the gods of good for a sliver of divine magic.",
    "description": "Unwilling to be outdone by the Crimson Reclaimers and their oath, you've petitioned the gods of good for a sliver of divine magic. Choose one of the following deities whose requirements you meet—for the Any Deity option below, you can select from the following deities or a deity the GM deems appropriate: Arazni, Arqueros, Falayna, Gendowyn, Iomedae, Kazutal, Kols, Milani, Pharasma, Ragathiel, Sarenrae, Shelyn, Suyuddha, Vildeis—and one of the listed spells. You can Cast that Spell once per day as a 4th-level divine innate spell, and you become trained in divine spell DCs and divine spell attack rolls. At 14th level, the spell heightens to 5th level; at 16th level, the spell heightens to 6th level. Once you've selected a deity and a spell, you can't change this selection. You don't need to worship the deity as your patron deity, as they are willing to grant this boon on behalf of your worthy cause. You must refrain from performing your deity's anathema or lose the ability to cast this spell until you atone. Any Deity: freedom of movement, remove curse, resist energy, spell immunity, statusGendowyn: barkskinIomedae: fire shieldIrori: stoneskinKazutal: mage armor, stoneskinMilani: fire shield, mage armorRagathiel: fire shieldSarenrae: wall of fireSpecial You can select this feat a second time at 14th level, gaining a second spell to cast once per day from your chosen deity's list or the Any Deity list, and you become an expert in divine spell DCs and divine spell attack rolls. You can select this feat a third time at 18th level. If you do, you gain a third spell to cast once per day from your chosen deity's list or the Any Deity list, and all three spells are heightened to 7th level.Traits\n\nArchetype: This feat belongs to an archetype.",
    "economy": "none",
    "trigger": ""
}