{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=1416",
    "name": "Empathetic Plea",
    "source": "Advanced Player's Guide",
    "rarity": "Common",
    "traits": [
        "Auditory",
        "Emotion",
        "Gnome",
        "Mental",
        "Visual"
    ],
    "level": 1,
    "prereq": "Trained In Diplomacy",
    "summary": "The way you cringe or use those puppydog eyes you've been practicing elicits an empathetic response in the attacker.",
    "description": "The way you cringe or use those puppydog eyes you've been practicing elicits an empathetic response in the attacker. Attempt a Diplomacy check against your attacker's Will DC.\n\nCritical Success The creature pulls its attack, wasting its action, and can't use hostile actions against you until the beginning of its next turn.\nSuccess The creature takes a –2 circumstance penalty to damage on the triggering Strike and all its Strikes against you until the beginning of its next turn. The penalty is –4 if you're an expert in Diplomacy, –6 if you're a master, and –8 if you're legendary.\nFailure The creature's attack is unaffected, and the creature is temporarily immune to your Empathic Pleas for 24 hours.Traits\n\nAuditory: Auditory actions and effects rely on sound. An action with the auditory trait can be successfully performed only if the creature using the action can speak or otherwise produce the required sounds. A spell or effect with the auditory trait has its effect only if the target can hear it. This applies only to sound-based parts of the effect, as determined by the GM. This is different from a sonic effect, which still affects targets who can't hear it (such as deaf targets) as long as the effect itself makes sound.\n\nEmotion: This effect alters a creature's emotions. Effects with this trait always have the mental trait as well. Creatures with special training or that have mechanical or artificial intelligence are immune to emotion effects.Gnome: A creature with this trait is a member of the gnome ancestry. Gnomes are small people skilled at magic who seek out new experiences and usually have low-light vision. An ability with this trait can be used or selected only by gnomes. A weapon with this trait is created and used by gnomes.Mental: A mental effect can alter the target's mind. It has no effect on an object or a mindless creature.Visual: A visual effect can affect only creatures that can see it. This applies only to visible parts of the effect, as determined by the GM.",
    "economy": "reaction",
    "trigger": "You are attacked by a creature that you haven't yet acted hostile toward. You must use this reaction before the creature rolls its attack."
}