{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=868",
    "name": "Wilderness Spotter",
    "source": "The Fall of Plaguestone",
    "rarity": "Uncommon",
    "traits": [
        "General",
        "Skill"
    ],
    "level": 2,
    "prereq": "Expert In Survival",
    "summary": "Use Survival for your Initiative when in a specific terrain.",
    "description": "Select one type of terrain from the following list: aquatic, arctic, desert, forest, mountain, plains, sky, swamp, or underground. You can use Survival in place of Perception to roll initiative when in the selected terrain in a natural location (not a structure) even if you weren’t tracking or otherwise using Survival before the encounter. You can also use Survival instead of Perception to notice traps in natural locations in the chosen terrain; if you find a snare in this way, you can also use Survival instead of Thievery to Disable the Device.\n\nSpecial You can select this feat more than once. Each time you select it, the feat applies to a new type of terrain.TraitsGeneral: A type of feat that any character can select, regardless of ancestry and class, as long as they meet the prerequisites. You can select a feat with this trait when your class grants a general feat.\n\nSkill: A general feat with the skill trait improves your skills and their actions or gives you new actions for a skill. A feat with this trait can be selected when a class grants a skill feat or general feat. Archetype feats with the skill trait can be selected in place of a skill feat if you have that archetype's dedication feat.Uncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.Noala's TrainingSource The Fall of Plaguestone pg. 56\nBy aiding an NPC from The Fall of Plaguestone, the PCs can learn some special woodland survival techniques.\n\nRelated Feats: Relentless Stalker",
    "economy": "none",
    "trigger": ""
}