{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2754",
    "name": "Sever Space",
    "source": "Pathfinder #168",
    "rarity": "Uncommon",
    "traits": [
        "Conjuration",
        "Fighter",
        "Flourish",
        "Teleportation"
    ],
    "level": 20,
    "prereq": "&Mdash;",
    "summary": "You destroy the space between you and your targets, allowing you to strike with your melee weapons at great range.",
    "description": "You destroy the space between you and your targets, allowing you to strike with your melee weapons at great range. Make a melee Strike with the required weapon or unarmed attack. The attack gains an 80-foot reach for this Strike.\n\n After the Strike, regardless of whether it succeeded, the world rushes to fill the space you destroyed, bringing you and the target adjacent to each other. You can choose to teleport to the closest space adjacent to the target or to attempt to teleport the target adjacent to you. If you choose the target, they can negate the teleportation if they succeed at a Fortitude save against your class DC.TraitsConjuration: Effects and magic items with this trait are associated with the conjuration school of magic, typically involving summoning, creation, teleportation, or moving things from place to place.\n\nFlourish: Flourish actions are actions that require too much exertion to perform a large number in a row. You can use only 1 action with the flourish trait per turn.Teleportation: Teleportation effects allow you to instantaneously move from one point in space to another. Teleportation does not usually trigger reactions based on movement.Uncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.Capstone FeatsSource Pathfinder #168: King of the Mountain pg. 75\nPlayer characters can select one of the following new class feats for their 20th-level class feat upon entering the Glass Lighthouse or by meditating on the cushion in area H4.\n\nRelated Feats: All the Time in the World, Dance of Intercession, Demon's Hair, Everdistant Defense, Extradimensional Stash, Head of the Night Parade, Heart of the Kaiju, Plum Deluge, Ruby Resurrection, Scapegoat Parallel Self, Time Dilation Cascade, Vitality-Manipulating Stance, Vivacious Afterimage, Whirlwind Toss, Worldsphere Gravity",
    "economy": "2-action",
    "trigger": ""
}