{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3409",
    "name": "Mighty Wings",
    "source": "Pathfinder #171",
    "rarity": "Uncommon",
    "traits": [
        "Archetype"
    ],
    "level": 18,
    "prereq": "Dragon Disciple Dedication; Dragon Wings Sorcerer Bloodline Spell",
    "summary": "Your dragon wings are now a permanent part of your body, giving you a fly Speed equal to your Speed.",
    "description": "Your dragon wings are now a permanent part of your body, giving you a fly Speed equal to your Speed. If you spend 1 Focus Point to cast dragon wings, your fly Speed increases to 90 feet for the duration, unless your Speed is faster, and you gain the effects of dragon claws for the duration.TraitsArchetype: This feat belongs to an archetype.\n\nUncommon: Something of uncommon rarity requires special training or comes from a particular culture or part of the world. Some character choices give access to uncommon options, and the GM can choose to allow access for anyone. Less is known about uncommon creatures than common creatures. They typically can't be summoned. The DC of Recall Knowledge checks related to these creature is increased by 2.Bloodsalt Dragon Disciple FeatsSource Pathfinder #171: Hurricane's Howl pg. 79\nThe following archetype feats are for the dragon disciple archetype. You must take the Dragon Disciple Dedication feat before selecting any of these feats, and you must select cloud dragon (which is associated with the electricity energy type) as the type of dragon you've studied. The feats below are dragon disciple archetype feats. By studying the ruins (see the AP for full details), you gain access to the dragon disciple archetype and to these feats\n\n If you have the draconic sorcerer bloodline, you must choose cloud dragon as your dragon type. This choice affects the dragon breath and dragon claws bloodline spells and several of the feats below.\n\n\nRelated Feats: Cloud Walk, Deflecting Cloud, Shape of the Cloud Dragon",
    "economy": "none",
    "trigger": ""
}