{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=1506",
    "name": "Portentous Spell",
    "source": "Advanced Player's Guide",
    "rarity": "Common",
    "traits": [
        "Manipulate",
        "Mental",
        "Metamagic",
        "Oracle",
        "Visual"
    ],
    "level": 16,
    "prereq": "&Mdash;",
    "summary": "Your spellcasting is rife with strange lights, esoteric gestures, and other captivating effects that befuddle your foes.",
    "description": "Your spellcasting is rife with strange lights, esoteric gestures, and other captivating effects that befuddle your foes. If the next action you use is to Cast a Spell, any creature that attempts to use a reaction triggered by your Cast a Spell activity takes a –2 circumstance penalty to attack rolls and skill checks rolled as part of the reaction. In addition, if the spell includes a spell attack roll or requires a saving throw, creatures you hit or that fail their saves are fascinated with you until the start of your next turn.Traits\n\nManipulate: You must physically manipulate an item or make gestures to use an action with this trait. Creatures without a suitable appendage can’t perform actions with this trait. Manipulate actions often trigger reactions.\n\nMental: A mental effect can alter the target's mind. It has no effect on an object or a mindless creature.Metamagic: Actions with the metamagic trait, usually from metamagic feats, tweak the properties of your spells. You must use a metamagic action directly before Casting the Spell you want to alter. If you use any action (including free actions and reactions) other than Cast a Spell directly after, you waste the benefits of the metamagic action. Any additional effects added by a metamagic action are part of the spell’s effect, not of the metamagic action itself.Visual: A visual effect can affect only creatures that can see it. This applies only to visible parts of the effect, as determined by the GM.",
    "economy": "1-action",
    "trigger": ""
}