{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=151",
    "name": "Animal Rage",
    "source": "Core Rulebook",
    "rarity": "Common",
    "traits": [
        "Barbarian",
        "Concentrate",
        "Instinct",
        "Polymorph",
        "Primal",
        "Rage",
        "Transmutation"
    ],
    "level": 8,
    "prereq": "Animal Instinct",
    "summary": "You transform into your animal.",
    "description": "You transform into your animal. You gain the effects of the 3rd-level animal form spell except you use your own statistics, temporary Hit Points, and unarmed attacks instead of those granted by animal form. You also retain the constant abilities of your gear. If your animal is a frog, your tongue’s reach increases to 15 feet. Dismissing the transformation gains the rage trait.Traits\n\nConcentrate: An action with this trait requires a degree of mental concentration and discipline.\n\nInstinct: Instinct abilities require a specific instinct; you lose access if you perform acts anathema to your instinct.Polymorph: These effects transform the target into a new form. A target can't be under the effect of more than one polymorph effect at a time. If it comes under the effect of a second polymorph effect, the second polymorph effect attempts to counteract the first. If it succeeds, it takes effect, and if it fails, the spell has no effect on that target. Any Strikes specifically granted by a polymorph effect are magical. Unless otherwise stated, polymorph spells don't allow the target to take on the appearance of a specific individual creature, but rather just a generic creature of a general type or ancestry.\n\n If you take on a battle form with a polymorph spell, the special statistics can be adjusted only by circumstance bonuses, status bonuses, and penalties. Unless otherwise noted, the battle form prevents you from casting spells, speaking, and using most manipulate actions that require hands. (If there's doubt about whether you can use an action, the GM decides.) Your gear is absorbed into you; the constant abilities of your gear still function, but you can't activate any items.Primal: This magic comes from the primal tradition, connecting to the natural world and instinct. Anything with this trait is magical.Rage: You must be raging to use abilities with the rage trait, and they end automatically when you stop raging.Transmutation: Effects and magic items with this trait are associated with the transmutation school of magic, typically changing something’s form.",
    "economy": "1-action",
    "trigger": ""
}