{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=3419",
    "name": "Bound in Ice",
    "source": "Monsters of Myth",
    "rarity": "Common",
    "traits": [
        "Archetype"
    ],
    "level": 16,
    "prereq": "Frostbite Runes",
    "summary": "You become a hybrid of your ancestry and a saumen kar.",
    "description": "You become a hybrid of your ancestry and a saumen kar. Your size increases to Large, and your reach becomes 10 feet. Your cold resistance increases to be equal to your level, and you gain fire resistance equal to half your level.\n\n You also gain the Blizzard Evasion reaction.\n\n Blizzard Evasion     Frequency once per day; Trigger You take 40 or more physical damage from a single attack; Effect You discorporate into a whirling blizzard for up to 3 rounds. During this time, you gain resistance 10 to physical damage and weakness 10 to force damage. You gain a fly speed of 40 feet, but the only action you can take is to Fly. The first time each round you enter another creature's space while discorporated, or the first time a creature enters your space, that creature takes 4d8 cold damage and must succeed at a Fortitude saving throw against your class DC or spell DC, whichever is higher, or else be stunned 1. At the start of your turn, you can end this effect as a free action.Traits\n\nArchetype: This feat belongs to an archetype.",
    "economy": "reaction",
    "trigger": "You take 40 or more physical damage from a single attack; Effect You discorporate into a whirling blizzard for up to 3 rounds. During this time, you gain resistance 10 to physical damage and weakness 10 to force damage. You gain a fly speed of 40 feet, but the only action you can take is to Fly. The first time each round you enter another creature's space while discorporated, or the first time a creature enters your space, that creature takes 4d8 cold damage and must succeed at a Fortitude saving throw against your class DC or spell DC, whichever is higher, or else be stunned 1. At the start of your turn, you can end this effect as a free action.Traits"
}