{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2953",
    "name": "Summoner Dedication",
    "source": "Secrets of Magic",
    "rarity": "Common",
    "traits": [
        "Archetype",
        "Dedication",
        "Multiclass"
    ],
    "level": 2,
    "prereq": "Charisma 14",
    "summary": "You've formed a bond with an eidolon, an entity that manifests in a physical body only through its link to your life force.",
    "description": "You've formed a bond with an eidolon, an entity that manifests in a physical body only through its link to your life force. Your bond may be tenuous, but that doesn't make your connection any less special. You gain an eidolon as well as the Manifest Eidolon activity. Due to your tenuous link, you can't gain or use tandem actions. Because you don't have Act Together, only you or your eidolon can perform an exploration activity at one time, so for instance you couldn't both be Searching or Investigating.\n\n Your eidolon is trained in unarmed attacks and unarmored defense, and shares your proficiency rank for Perception, saving throws, and skill checks. Choose an eidolon type. You become trained in your eidolon's listed skills. For each of those skills that you are already trained in, you become trained in a different skill of your choice. Your eidolon's initial ability scores are reduced. It starts with a 16 in any ability score listed at 18 for its eidolon array. It otherwise gains the statistics listed for an eidolon of that type.\n\n At 5th level, the eidolon's ability score that was reduced to 16 increases to 18, before applying ability boosts. At levels 5, 10, 15, and 20, your eidolon also gets four ability boosts, which follow the same rules as yours.Manifest Eidolon    ConcentrateConjurationManipulateSummonerTeleportation\nSource Secrets of Magic pg. 52\n\n------\n\nYour eidolon appears in an open space adjacent to you, and can then take a single action. If your eidolon was already manifested, you unmanifest it instead.\n\n The conduit that allows your eidolon to manifest is also a tether between you. Your eidolon must remain within 100 feet of you at all times and can't willingly go beyond that limit. If forced beyond this distance, or if you are reduced to 0 Hit Points, your eidolon's physical form dissolves: your eidolon unmanifests, and you need to use Manifest Eidolon to manifest it again.\n\nSpecial This activity has the trait matching your eidolon's tradition (arcane, divine, occult, or primal).\n\n------\n\nSpecial You can't select another dedication feat until you have gained two other feats from the summoner archetype.Summoner Dedication Leads To...\n\nBasic Summoner Spellcasting, Basic Synergy, Expert Combat Eidolon, Initial Eidolon AbilityTraitsArchetype: This feat belongs to an archetype.\n\nDedication: You must select a feat with this trait to apply an archetype to your character.Multiclass: Archetypes with the multiclass trait represent diversifying your training into another class’s specialties. You can’t select a multiclass archetype’s dedication feat if you are a member of the class of the same name.",
    "economy": "3-action",
    "trigger": ""
}