{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=1346",
    "name": "Form of the Bat",
    "source": "Advanced Player's Guide",
    "rarity": "Common",
    "traits": [
        "Concentrate",
        "Dhampir",
        "Divine",
        "Polymorph",
        "Transmutation"
    ],
    "level": 13,
    "prereq": "&Mdash;",
    "summary": "You can transform into a harmless bat.",
    "description": "You can transform into a harmless bat. You gain the effects of a 4th-level pest form, except you always transform into a bat.Traits\n\nConcentrate: An action with this trait requires a degree of mental concentration and discipline.\n\nDhampir: A creature with this trait has the dhampir versatile heritage. These humanoids are the mortal offspring of vampires and members of other ancestries.Divine: This magic comes from the divine tradition, drawing power from deities or similar sources. Anything with this trait is magical.Polymorph: These effects transform the target into a new form. A target can't be under the effect of more than one polymorph effect at a time. If it comes under the effect of a second polymorph effect, the second polymorph effect attempts to counteract the first. If it succeeds, it takes effect, and if it fails, the spell has no effect on that target. Any Strikes specifically granted by a polymorph effect are magical. Unless otherwise stated, polymorph spells don't allow the target to take on the appearance of a specific individual creature, but rather just a generic creature of a general type or ancestry.\n\n If you take on a battle form with a polymorph spell, the special statistics can be adjusted only by circumstance bonuses, status bonuses, and penalties. Unless otherwise noted, the battle form prevents you from casting spells, speaking, and using most manipulate actions that require hands. (If there's doubt about whether you can use an action, the GM decides.) Your gear is absorbed into you; the constant abilities of your gear still function, but you can't activate any items.Transmutation: Effects and magic items with this trait are associated with the transmutation school of magic, typically changing something’s form.",
    "economy": "1-action",
    "trigger": ""
}