{
    "url": "https://2e.aonprd.com/Feats.aspx?ID=2980",
    "name": "Reflective Ripple Stance",
    "source": "Secrets of Magic",
    "rarity": "Common",
    "traits": [
        "Evocation",
        "Monk",
        "Stance",
        "Water"
    ],
    "level": 1,
    "prereq": "&Mdash;",
    "summary": "You enter a stance of fluid grace as small amounts of water flow with your movements and attacks.",
    "description": "You enter a stance of fluid grace as small amounts of water flow with your movements and attacks. You can make flowing wave attacks that deal 1d6 bludgeoning damage. They are in the brawling group and have the agile, disarm, finesse, nonlethal, trip, unarmed, and water traits.\n\n While in Reflective Ripple Stance, you gain a +1 circumstance bonus to Athletics checks to Disarm, Swim, or Trip, and you gain a +2 circumstance bonus to your Reflex DC to avoid being Disarmed and Tripped.\n\nSpecial This feat gains your choice of either the divine or occult trait, matching your ki spell tradition if possible.Reflective Ripple Stance Leads To...\n\nRippling Spin, Wave SpiralTraitsEvocation: Effects and magic items with this trait are associated with the evocation school of magic, typically involving energy and elemental forces.\n\nStance: A stance is a general combat strategy that you enter by using an action with the stance trait, and that you remain in for some time. A stance lasts until you get knocked out, until its requirements (if any) are violated, until the encounter ends, or until you enter a new stance, whichever comes first. After you use an action with the stance trait, you can’t use another one for 1 round. You can enter or be in a stance only in encounter mode.Water: Effects with the water trait either manipulate or conjure water. Those that manipulate water have no effect in an area without water. Creatures with this trait consist primarily of water or have a magical connection to the element. Planes with this trait are mostly liquid, perhaps with pockets of breathable air.",
    "economy": "1-action",
    "trigger": ""
}