{
    "url": "https://2e.aonprd.com/Spells.aspx?ID=1125",
    "name": "Sign of Conviction",
    "source": "Knights of Lastwall",
    "traditions": [
        "Divine"
    ],
    "rarity": "Uncommon",
    "traits": [
        "Conjuration"
    ],
    "cantrip": false,
    "focus": false,
    "level": 3,
    "summary": "You conjure the religious symbol of your deity into the air above you in the same space you stand in, wielding the power of your faith to smite your foes.",
    "heightenable": true,
    "description": "You conjure the religious symbol of your deity into the air above you in the same space you stand in, wielding the power of your faith to smite your foes. This religious symbol is immobile, made of pure magical force, and can't be damaged. As long as you Sustain sign of conviction, you gain a +1 status bonus to AC and saving throws and are immobilized. The DC for any effect to force you to move out of your space (such as the Shove action) is equal to your spell DC or the normal DC, whichever is higher. If you stop being immobilized or are moved out of your space, sign of conviction immediately ends.\n\n When you Cast the Spell and each time you Sustain the Spell, the religious symbol emits a blast of energy at a target within 100 feet. Make a spell attack roll that deals 2d10 damage on a success (see below for determining damage type) and double damage on a critical success. You can Sustain the Spell multiple times in the same round to emit an array of blasts.\n\n If you worship a good deity, the spell gains the good and light traits, deals your choice of either fire or good damage, and emits bright light in a 20-foot burst. If you worship an evil deity, the spell gains the evil and darkness traits, deals your choice of cold or evil damage, and reduces the light level in a 20-foot burst to dim light if it would be brighter. If you worship a neutral deity, the spell gains the force trait and deals force damage.\n\n------\n\nHeightened (+2)  The damage increases by 1d10.",
    "economy": "2-action",
    "components": [
        "Somatic",
        "Verbal"
    ],
    "trigger": "",
    "range": "",
    "target": "",
    "duration": "sustained up to 1 minute",
    "saving": "",
    "school": "Conjuration"
}