{
    "url": "https://2e.aonprd.com/Spells.aspx?ID=929",
    "name": "Impending Doom",
    "source": "Secrets of Magic",
    "traditions": [
        "Arcane",
        "Divine",
        "Occult"
    ],
    "rarity": "Common",
    "traits": [
        "Divination",
        "Emotion",
        "Fear",
        "Incapacitation",
        "Mental",
        "Prediction"
    ],
    "cantrip": false,
    "focus": false,
    "level": 3,
    "summary": "Make a foe witness its potential death and become distressed.",
    "heightenable": true,
    "description": "You sift through myriad potential futures, seize upon one potential moment in which the target meets a particularly gruesome and fatal end, and then show it a vision of its impending demise. The intense mental vision grows more and more terrifying to the target as the doom grows closer, and it takes 3 rounds to reach its conclusion. The target must attempt a Will saving throw to determine the effects. At the end of the spell's duration, if the target was affected, the target witnesses its death and takes 6d6 mental damage.\n\nCritical Success The creature is unaffected.\nSuccess The creature is unaffected for 1 round. On the second round, it becomes flat-footed. Finally, on the third round, it becomes frightened 1. At the end of the third round, it takes half damage.\nFailure The creature is immediately flat-footed. On the second round, it becomes frightened 2. Finally, on the third round, it also becomes stunned 1. At the end of the third round, the creature takes full damage.\nCritical Failure The creature is immediately flat-footed and frightened 3. On the second round, it becomes stunned 1. Finally, on the third round, it also becomes paralyzed. At the end of the third round, the creature takes double damage.\n\n------\n\nHeightened (+1) The damage increases by 2d6.",
    "economy": "2-action",
    "components": [
        "Somatic",
        "Verbal"
    ],
    "trigger": "",
    "range": "30 feet",
    "target": "1 living creature",
    "duration": "3 rounds",
    "saving": "Will"
}