{
    "url": "https://2e.aonprd.com/Spells.aspx?ID=16",
    "name": "Avatar",
    "source": "Core Rulebook",
    "traditions": [
        "Divine"
    ],
    "rarity": "Common",
    "traits": [
        "Polymorph",
        "Transmutation"
    ],
    "cantrip": false,
    "focus": false,
    "level": 10,
    "summary": "Transform into a battle form determined by your deity.",
    "heightenable": false,
    "description": "You transform into an avatar of your deity, assuming a Huge battle form. You must have space to expand or the spell is lost. You have hands in this battle form and can take manipulate actions. You can Dismiss this spell.\n\n You gain the following statistics and abilities regardless of which deity's battle form you assume: AC = 25 + your level. Ignore your armor's check penalty and Speed reduction. 30 temporary Hit Points. Darkvision. One or more attacks specific to your deity's battle form, which are the only attacks you can use. You're trained with them. Your attack modifier is +33, and you use the listed damage. Melee attacks are Strength based (for the purposes of the enfeebled condition, for example) unless they have the finesse trait, and all ranged attacks are Dexterity based. Attacks that deal positive or negative damage don't heal creatures. Athletics modifier of +35, unless your own is higher. You also gain the specific abilities listed for your deity below:Core RulebookAbadar Speed 50 feet, burrow Speed 30 feet, immune to immobilized; Ranged     crossbow (range increment 120 feet, reload 1), Damage 6d10+3 piercing.Asmodeus Speed 70 feet, air walk; Melee     mace (reach 15 feet), Damage 6d10+6 bludgeoning; Ranged     hell fire (range 120 feet), Damage 6d6+3 fire.Calistria Speed 30 feet, fly Speed 70 feet; Melee     whip (disarm, finesse, nonlethal, reach 20 feet), Damage 6d4+6 slashing; Ranged     savored sting (range 60 feet), Damage 6d6+3 poison.Cayden Cailean Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     rapier (deadly, reach 15 feet), Damage 6d6+6 piercing; Ranged     ale splash (range 120 feet), Damage 6d6+3 poison.Desna Speed 30 feet, fly Speed 70 feet; Melee     starknife (agile, deadly, finesse, reach 15 feet, silver, thrown 60 feet), Damage 6d4+6 piercing; Ranged     moonbeam (range 120 feet, silver), Damage 6d6+3 fire.Erastil Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Ranged    longbow (deadly d8, range increment 150 feet), Damage 6d8+3 piercing.Gorum Speed 70 feet, immune to immobilized; Melee     greatsword (versatile P, reach 15 feet), Damage 6d12+6 slashing.Gozreh no land Speed, fly Speed 70 feet, swim Speed 70 feet, ignore difficult terrain and greater difficult terrain; Melee     waves (bull rush, reach 15 feet, thrown 20 feet), Damage 6d8+6 bludgeoning; Ranged     wind (versatile electricity, range 120 feet), Damage 6d6+3 bludgeoning.Iomedae Speed 70 feet, air walk; shield (15 Hardness, can't be damaged); Melee     longsword (versatile P, reach 15 feet), Damage 6d8+6 slashing.Irori Speed 80 feet, air walk; Melee     unfettered strike (agile, versatile P or S, finesse, reach 15 feet), Damage 6d8+6 bludgeoning; Ranged     wind strike (range 60 feet), Damage 6d4+6 bludgeoning.Lamashtu Speed 30 feet, fly Speed 70 feet; Melee     falchion (forceful, reach 15 feet), Damage 6d10+6 slashing; Ranged     waters of Lamashtu (range 120 feet), Damage 6d6+3 poison.Nethys Speed 70 feet, air walk; Ranged     raw magic (range 120 feet; versatile cold, electricity, or fire), Damage 6d6 force.Norgorber Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     shortsword (agile, finesse, versatile S, reach 15 feet), Damage 6d6+6 piercing; Ranged     blackfinger toss (range 120 feet), Damage 6d6+3 poison.Pharasma Speed 70 feet, air walk; Melee     dagger (agile, finesse, reach 15 feet, thrown 40 feet), Damage 6d6+6 slashing; Ranged     spiral blast (range 120 feet, damages only undead), Damage 6d8+3 positive.Rovagug Speed 50 feet, burrow Speed 30 feet, immune to immobilized; Melee    jaws (reach 15 feet), Damage 6d12+6 piercing; Melee    leg (agile, versatile P, reach 15 feet), Damage 6d8+6 bludgeoning.Sarenrae Speed 30 feet, fly Speed 70 feet; Melee     scimitar (forceful, nonlethal, reach 15 feet), Damage 6d6+6 slashing; Ranged     everflame (nonlethal, range 120 feet), Damage 6d6+3 fire.Shelyn Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     glaive (deadly d8, nonlethal, reach 20 feet), Damage 6d8+6 slashing; Ranged     melody of inner beauty, (nonlethal, range 120 feet), Damage 6d6+3 sonic.Torag Speed 50 feet, burrow Speed 30 feet, immune to immobilized; shield (15 Hardness, can't be damaged); Melee     warhammer (bull rush, reach 15 feet), Damage 6d8+6 bludgeoning.Urgathoa Speed 70 feet, air walk; Melee    scythe (deadly d10, trip, reach 15 feet), Damage 6d10+6 slashing; Ranged     pallid plague (range 120 feet), Damage 6d6+3 negative.Zon-Kuthon Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     spiked chain (disarm, trip, reach 15 feet), Damage 6d8+6 slashing; Ranged     midnight pain (mental, nonlethal, range 120 feet), Damage 6d6+3 mental.Gods &amp; MagicAchaekek Speed 70 feet, climb Speed 50 feet, ignore difficult terrain and greater difficult terrain; Melee     mantis claw (agile, backswing, finesse, reach 15 feet, versatile P), Damage 6d8+6 slashing; Ranged     spine volley (range 60 feet), Damage 6d6+3 piercing.Alseta Speed 40 feet, dimensional Speed 60 feet; Melee     dagger (agile, finesse, reach 15 feet, thrown 40 feet, versatile P), Damage 6d6+6 piercing; Ranged     portal toss (range 60 feet), Damage 6d6+3 bludgeoning. When casting the avatar spell, a worshipper of Alseta gains the following additional abilities. The dimensional Speed allows the avatar of Alseta to cast dimension door at will as a divine innate spell, spending a single action to move up to 60 feet. The portal toss Strike causes the creature to fall through a series of portals before landing in the same spot and taking damage.Arazni Speed 70 feet, air walk, immune to immobilized; Melee     rapier (deadly 3d8, reach 15 feet), Damage 6d8+6 piercing; Ranged     call blood (range 120 feet), Damage 6d6 persistent bleed damage.Besmara Speed 40 feet, swim Speed 70 feet, immune to immobilized; Melee     rapier (deadly 3d8, disarm, finesse, reach 15 feet), Damage 6d6+6 piercing; Ranged     ship’s cannon (range 120 feet), Damage 6d6+3 bludgeoning.Brigh Speed 60 feet, immune to immobilized, air walk; Melee     light hammer (agile, reach 15 feet, thrown 40 feet), Damage 6d6+6 bludgeoning; Ranged     bolt of molten bronze (range 120 feet), Damage 6d8+3 fire.Casandalee Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     polytool (reach 15 feet), Damage 6d6+6 slashing; Ranged     logic blast (range 120 feet), Damage 6d6+3 mental.Chaldira Speed 70 feet, air walk, immune to immobilized; Melee     shortsword (agile, finesse, reach 15 feet, versatile S), Damage 6d6+6 piercing; Ranged     fistful of buttons (nonlethal, range 120 feet), Damage 6d6+3 bludgeoning.Ghlaunder Speed 30 feet, fly Speed 70 feet; Melee     proboscis (agile, reach 20 feet), Damage 6d6+6 piercing plus 3d6 persistent bleed.Grandmother Spider Speed 70 feet, climb Speed 70 feet, immune to immobilized; Melee     leg (deadly 3d8, finesse, reach 15 feet, versatile P), Damage 6d6+6 bludgeoning; Ranged     venom web (range 120 feet), Damage 6d6+3 poison.Groetus Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     war flail (disarm, reach 15 feet, sweep, trip), Damage 6d10+6 bludgeoning; Ranged     dreadful thought (range 120 feet), Damage 6d6+3 mental.Gruhastha Speed 50 feet, fly Speed 70 feet; Melee     fist (agile, finesse, nonlethal, reach 15 feet), Damage 6d6+6 bludgeoning; Ranged     arrow of enlightenment (deadly 3d10, range increment 120 feet), Damage 6d6+3 piercing.Hei Feng Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     drunken sword (forceful, reach 15 feet), Damage 4d6+6 slashing plus 1d6 electricity splash damage; Ranged     storm surge (range 120 feet, air, water), Damage 4d6+3 bludgeoning plus 1d6 electricity splash damage. The caster is immune to this splash damage.Kazutal Speed 60 feet, ignore difficult terrain; Melee     machete (agile, reach 15 feet), Damage 6d6+6 slashing; Ranged     jaguar pounce (range 60 feet); Damage 5d6+3 piercing plus 1d6 persistent bleed.Kurgess Speed 70 feet, climb Speed 50 feet, swim Speed 50 feet, immune to immobilized; Melee     lashing chain (disarm, reach 20 feet, trip), Damage 6d6+6 bludgeoning; Ranged     javelin (range increment 60 feet, thrown), Damage 6d6+3 piercing.Milani Speed 50 feet, fly Speed 70 feet; shield (15 Hardness, can’t be damaged); Melee     morningstar (versatile P, reach 15 feet), Damage 6d8+6 bludgeoning.Nivi Rhombodazzle Speed 50 feet, burrow Speed 30 feet, immune to immobilized; Melee     returning light hammer (agile, thrown 40 feet), Damage 6d6+6 bludgeoning.Nocticula Speed 70 feet, fly Speed 70 feet; Melee     tail stinger (agile, finesse, reach 15 feet, trip), Damage 6d6+6 slashing; Ranged     magnanimous smile (nonlethal, range 120 feet, visual), Damage 6d6+3 mental.Shizuru Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     katana (deadly 3d8, two-hand d10, reach 15 feet, versatile P), Damage 6d6+6 slashing; Ranged     sunbolt arrow (range 120 feet), Damage 6d6+3 fire.Sivanah Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     bladed scarf (disarm, finesse, reach 15 feet, trip), Damage 6d8+6 slashing; Ranged     illusory assault (range 120 feet), Damage 6d6+3 mental.Tsukiyo Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     longspear (reach 20 feet), Damage 6d10+6 piercing; Ranged     moonbeam (nonlethal, range 120 feet, silver), Damage 6d6+3 mental.The Mwangi ExpanseAdanye Speed 70 feet, climb speed 70 feet, immune to immobilized; Melee     claw (agile, finesse, reach 15 feet), Damage 6d10+6 slashing; Ranged     hearth ember (range 120 feet), Damage 4d6+3 fire and 2d6 persistent fireAngazhan Speed 60 feet, climb speed 60 feet; Melee     fist (agile, reach 15 feet), Damage 6d8+6 bludgeoning; Ranged     Bellowing Roar (range increment 100 feet), Damage 6d6+3 mentalBalumbdar Speed 70 feet, climb 50 feet, immune to immobilized; Melee     slam (reach 15 feet), Damage 6d12+4 bludgeoning; Ranged     overbearing pressure (range 120 feet), Damage 6d6+3 bludgeoningChohar Speed 70 feet, air walk; Melee     jaws (agile, reach 15 feet), Damage 5d6+6 piercing plus 1d6 fire damage; Ranged     sunbeam (range 120 feet), Damage 6d6+6 fireKalekot Speed 70 feet, ignore difficult terrain; Melee     ivory fangs (fatal d10, reach 10 feet), Damage 6d6+6 piercing; Ranged     whisper of unmaking (range 120 feet), Damage 6d6+3 slashingLubaiko Speed 30 feet, fly speed 70 feet; Melee     longspear (reach 20 feet), Damage 6d12+6 piercing; Ranged     flaming lightning (versatile fire, range 120 feet), Damage 6d6+3 electricityLuhar Speed 70 feet, ignore difficult terrain and greater difficult terrain; Melee     spiked chain (disarm, finesse, trip, reach 15 feet), Damage 6d8+6 slashing; Ranged     touch of mercy (range increment 120 feet), Damage 6d6+3 negativeMazludeh Speed 70 feet, climb 50 feet, shield (15 hardness, can't be damaged); Melee     viper strike (reach 15 feet), Damage 6d10+6 piercing; Ranged     stone rain (range 120 feet), Damage 6d6+3 bludgeoningTlehar Speed 50 feet, fly speed 70 feet, cannot be immobilized; Melee     morningstar (versatile piercing, reach 15 feet), Damage 6d6+6 bludgeoning; Ranged     morning light (range increment 120 feet), Damage 3d6+3 fire and 3d6+3 positiveUvuko Speed 30 feet, fly speed 70 feet, immune to immobilized; Melee     maul (shove, reach 15 feet), Damage 6d12+6 bludgeoning; Ranged     breath of lightning (range increment 120 feet), Damage 6d6+3 electricityWalkena Speed 60 feet, air walk; Melee     holy spear (reach 20 feet; versatile fire), Damage 6d12+6 piercing; Ranged     sunfire (range increment 120 feet), Damage 6d6+6 firePathfinder #176: Lost Mammoth ValleyAlglenweis Speed 70 feet, air walk, immune to difficult terrain and greater difficult terrain; Melee     icicle (agile, reach 15 feet), Damage 4d6+6 piercing plus 2d6 cold; Ranged     blizzard blast (range 120 feet), Damage 6d6 coldBergelmir Speed 60 feet, air walk; Melee     staff (reach 15 feet, two-handed d8), Damage 6d6+6 bludgeoning; Ranged     resonating wisdom (nonlethal, range 120 feet), Damage 6d6+3 mentalFandarra Speed 70 feet, immune to immobilized, ignore difficult terrain and greater difficult terrain; Melee     dagger (agile, finesse, reach 15 feet, thrown 40 feet, versatile P), Damage 6d6+6 piercing; Ranged     life blast (range 60 feet, versatile positive), Damage 6d6+3 negativeImmonhiel Speed 50 feet, fly Speed 70 feet; Melee     hatchet (agile, reach 15 feet, sweep, thrown 40 feet), Damage 6d6+6 slashing; Ranged     harmful vapors (range 60 feet), Damage 5d6 poison plus 1d6 poison splash damage. The caster is immune to this splash damage.Ng Speed 70 feet, air walk, immune to immobilized, ignore difficult and greater difficult terrain; Melee     gauntlet (agile, free-hand, reach 15 feet), Damage 6d4+6 bludgeoning; Ranged     seasonal blast (range 120 feet, versatile cold, fire, or slashing), Damage 6d6+3 bludgeoningRowdrosh Speed 70 feet, ignore difficult terrain and greater difficult terrain; Melee     crook (reach 15 feet,trip, two-handed d8), Damage 6d6+6 bludgeoning plus Grab; Ranged     sheep stampede (range 120 feet), Damage 6d6+3 bludgeoningSkode Speed 70 feet, air walk, ignore difficult terrain and greater difficult terrain; Melee     spear (reach 15 feet, thrown 40 feet), Damage 6d6+6 piercing; Ranged     longbow (deadly 3d10, range increment 150 feet), Damage 6d8+3 piercingTanagaar Speed 50 feet, fly Speed 70 feet, immune to immobilized; Melee     beak (reach 15 feet), Damage 6d8+6 piercing; Melee     talons (agile, cold iron, finesse, reach 15 feet), Damage 6d6+6 slashing; Ranged     hurled pinion (agile, cold iron, range 120 feet), Damage 6d6+3 piercingKnights of LastwallArqueros When casting the avatar spell, a worshipper of Arqueros typically becomes a resplendent figure clad head to toe in gleaming golden armor, gripping a diamond-bladed spear in a gauntleted hand and a mighty shield in the other. They gain the following additional abilities.\n Arqueros Speed 60 feet, immune to immobilized; shield (15 Hardness, can't be damaged); Melee     spear (reach 15 feet), Damage 6d8+6 piercing; Ranged     gaze of the stalwart guardian (range 60 feet, visual), Damage 6d6+3 mentalFalayna When casting the avatar spell, a worshipper of Falayna is typically girded in a silver breastplate and fashionable attire. They clutch a razor-edged longsword in hands bedecked in jeweled rings. They gain the following additional abilities.\n Falayna Speed 70 feet, air walk; Melee     longsword (reach 15 feet, versatile piercing), Damage 6d8+6 slashing; Ranged     ring salvo (range 120 feet), Damage 6d6+3 bludgeoning\nGendowyn When casting the avatar spell, a worshipper of Gendowyn typically becomes a being of earth and living flora, with furry, hooved legs and control over nature. They gain the following additional abilities. Gendowyn Speed 60 feet, burrow 30 feet, climb 30 feet; Melee     whip of lashing vines (disarm, finesse, nonlethal, reach 20 feet, trip), Damage 6d4+6 slashing; Ranged     nature's wrath unbound (range 60 feet, ranged trip, versatile piercing, versatile slashing), Damage 6d6+3 bludgeoningKols When casting the avatar spell, a worshipper of Kols typically becomes a living embodiment of justice, with a tome of laws to protect the innocent, a gavel to subdue the guilty, and the wisdom and courage to discern which is which. They gain the following additional abilities.\n Kols Speed 50 feet, ignore difficult terrain and greater difficult terrain, immune to immobilized; Melee     decisive gavel (agile, reach 15 feet, thrown 40 feet), Damage 6d6+6 bludgeoning; Ranged     pronounce judgment (auditory, nonlethal, range 120 feet), Damage 6d6+3 sonicRagathiel When casting the avatar spell, a worshipper of Ragathiel typically grows five wings of flame upon their back and wields a flaming bastard sword. They gain the following additional abilities.\n Ragathiel Speed 30 feet, fly 70 feet; Melee     bastard sword (reach 15 feet, silver, two-handed d12), Damage 5d8+6 slashing plus 1d8 fire; Ranged     flames of righteous vengeance (range 60 feet), Damage 4d6+3 fire plus 1d6 fire splash damage. The caster is immune to this splash damage.Suyuddha When casting the avatar spell, a worshipper of Suyuddha typically has shining golden eyes, tiger-like markings upon their flesh, and wears armor composed of fractal angles. They gain the following additional abilities.\n Suyuddha Speed 70 feet, air walk; Melee     tekko-kagi (agile, disarm, finesse, parry, reach 15 feet, trip), Damage 6d4+6 slashing; Ranged     calculated countermeasures (range 60 feet, versatile bludgeoning, versatile slashing), Damage 6d6+3 piercingVildeis When casting the avatar spell, a worshipper of Vildeis typically sprouts blood-soaked wings from their back. Celestial sigils carved into their flesh recount every worthy sacrifice they've ever made. They gain the following additional abilities.\n Vildeis Speed 30 feet, fly 70 feet; Melee     dagger (agile, finesse, reach 15 feet, thrown 40 feet, versatile slashing), Damage 5d4+6 piercing plus 1d6 persistent bleed damage; Ranged     cry of the martyred (range 120 feet), Damage 5d6+3 sonic plus 1d6 persistent mental",
    "economy": "1-to-2-actions",
    "components": [
        "Somatic",
        "Verbal"
    ],
    "trigger": "",
    "range": "",
    "target": "",
    "duration": "1 minute",
    "saving": "",
    "school": "Transmutation"
}