{
    "url": "https://2e.aonprd.com/Spells.aspx?ID=878",
    "name": "Burning Blossoms",
    "source": "Secrets of Magic",
    "traditions": [
        "Arcane",
        "Primal"
    ],
    "rarity": "Common",
    "traits": [
        "Enchantment",
        "Fire",
        "Plant"
    ],
    "cantrip": false,
    "focus": false,
    "level": 8,
    "summary": "A tree fascinates enemies and burns creatures that stay beneath it.",
    "heightenable": true,
    "description": "An intangible hollow tree sprouts from the ground and grows to towering height, radiating a fiery passion and fascinating viewers. The base of the tree takes up a single square and grows 100 feet upwards, while its branches extend outwards 30 feet, forming the spell's cylindrical area. The tree then blossoms, growing delicate white flowers that burn with white-hot fire. As the tree's branches gently rustle in the wind, flower petals drift to the ground in a shower of flame. Any creature that ends its turn under the tree's branches takes 6d6 fire damage from the burning petals.\n\n Any enemy that can see the tree, even if the enemy is outside the spell's area, must attempt a Will save. This is an emotion, mental, and visual effect. Creatures fascinated with the tree must use at least one of their actions on each of their turns to move toward the tree.\n\nCritical Success The creature is unaffected and is temporarily immune for 24 hours.\nSuccess The creature is unaffected, but it must attempt a new save at the end of its turn if it can still see the tree.\nFailure The creature is fascinated with the tree until the end of its next turn. If it can still see the tree then, it must attempt a save again.\nCritical Failure The creature is fascinated with the tree until the spell ends. The tree's fire damage doesn't end the fascination; other hostile actions end it, as normal. If the fascination ends, the creature must attempt a new save at the end of its turn if it can still see the tree.\n\n------\n\nHeightened (+1) The damage increases by 1d6.",
    "economy": "3-action",
    "components": [
        "Somatic",
        "Verbal"
    ],
    "trigger": "",
    "range": "120 feet",
    "target": "",
    "duration": "1 minute",
    "saving": "Will"
}