{
    "url": "https://2e.aonprd.com/Spells.aspx?ID=724",
    "name": "Transmute Rock and Mud",
    "source": "Advanced Player's Guide",
    "traditions": [
        "Arcane",
        "Primal"
    ],
    "rarity": "Common",
    "traits": [
        "Earth",
        "Transmutation"
    ],
    "cantrip": false,
    "focus": false,
    "level": 5,
    "summary": "Turn an area of rock into mud or vice versa.",
    "heightenable": true,
    "description": "You warp the structure of earthen material, turning rock into mud or mud into rock. Choose one of these two options when you Cast the Spell.Mud to Rock Mud in the area turns into unworked stone. If creatures are in the mud when it is transformed to stone, they must attempt a Reflex saving throw.\n\nCritical Success The creature escapes the mud and is atop the stone, unaffected.\nSuccess The creature climbs out of the mud as it turns to rock and is prone atop the stone.\nFailure The creature is partially stuck in the mud and is grabbed for 1 round or until it Escapes, whichever comes first.\nCritical Failure The creature is entirely stuck. It is restrained for 1 round or until it Escapes, whichever comes first.Rock to Mud You transform non-magical, unworked, and unattended stone in the area into an equal volume of mud. If you Cast this Spell on a stone floor, it becomes difficult terrain; if the resulting mud is at least 3 feet deep, it is greater difficult terrain, or the creature can try to Swim through it (DC 10 Athletics). If the mud is deep enough that a creature can't reach the bottom, the creature must Swim to move through it. If you Cast this Spell on a ceiling, the falling mud deals 8d6 bludgeoning damage (basic Reflex save) and spreads out, creating difficult terrain in an area 10 feet larger in radius than the original spell's area. Once the rock is transformed into mud, the mud is non-magical and remains until natural conditions cause it to dry out or otherwise disperse.\n\n------\n\nHeightened (+2) Add an additional 10-foot cube to the area, adjacent to at least one of the other cubes.",
    "economy": "3-action",
    "components": [
        "Somatic",
        "Verbal",
        "Material"
    ],
    "trigger": "",
    "range": "60 feet",
    "target": "",
    "duration": "",
    "saving": ""
}