{
    "url": "https://2e.aonprd.com/Spells.aspx?ID=351",
    "name": "Unrelenting Observation",
    "source": "Core Rulebook",
    "traditions": [
        "Arcane",
        "Occult"
    ],
    "rarity": "Common",
    "traits": [
        "Divination",
        "Scrying"
    ],
    "cantrip": false,
    "focus": false,
    "level": 8,
    "summary": "You and other creatures use scrying to track a subject exactly.",
    "heightenable": false,
    "description": "This spell grants perfect sight based on scrying, allowing several willing targets to track the exact movements or position of one creature or object. Choose one target creature or object in the area to be tracked. It becomes the sensor for the spell. Up to five willing creatures of your choice in the area can see a ghostly image of this creature or object when it's out of their sight. They can perceive the creature or object perfectly, allowing them to ignore the concealed or invisible condition, though physical barriers still provide cover.\n\n The tracking creatures can see the tracked creature or object through all barriers other than lead or running water, which block their vision. Distance doesn't matter, though the creature or object might move so far away it becomes too small to perceive. The tracking creatures don't see any of the environment around the target, though they do see any gear a creature is wearing or holding, and they can tell if it removes objects from its person.\n\n If the target to be tracked is willing, the duration is 1 hour. If you try to track an unwilling creature, the target must attempt a Will save.\n\nCritical Success The creature or object is unaffected.\nSuccess As described, and the duration is 1 minute.\nFailure As described, and the duration is 1 hour.",
    "economy": "2-action",
    "components": [
        "Somatic",
        "Verbal"
    ],
    "trigger": "",
    "range": "100 feet",
    "target": "1 creature or object tracked and up to 5 other willing creatures",
    "duration": "varies",
    "saving": "",
    "school": "Divination"
}