{
    "url": "https://2e.aonprd.com/Spells.aspx?ID=34",
    "name": "Charm",
    "source": "Core Rulebook",
    "traditions": [
        "Arcane",
        "Occult",
        "Primal"
    ],
    "rarity": "Common",
    "traits": [
        "Emotion",
        "Enchantment",
        "Incapacitation",
        "Mental"
    ],
    "cantrip": false,
    "focus": false,
    "level": 1,
    "summary": "A creature becomes more friendly to you.",
    "heightenable": true,
    "description": "To the target, your words are honey and your visage seems bathed in a dreamy haze. It must attempt a Will save, with a +4 circumstance bonus if you or your allies recently threatened it or used hostile actions against it.\n\n You can Dismiss the spell. If you use hostile actions against the target, the spell ends. When the spell ends, the target doesn't necessarily realize it was charmed unless its friendship with you or the actions you convinced it to take clash with its expectations, meaning you could potentially convince the target to continue being your friend via mundane means.\n\nCritical Success The target is unaffected and aware you tried to charm it.\nSuccess The target is unaffected but thinks your spell was something harmless instead of charm, unless it identifies the spell (see Identifying Spells).\nFailure The target's attitude becomes friendly toward you. If it was friendly, it becomes helpful. It can't use hostile actions against you.\nCritical Failure The target's attitude becomes helpful toward you, and it can't use hostile actions against you.\n\n------\n\nHeightened (4th) The duration lasts until the next time you make your daily preparations.\nHeightened (8th) The duration lasts until the next time you make your daily preparations, and you can target up to 10 creatures.",
    "economy": "2-action",
    "components": [
        "Somatic",
        "Verbal"
    ],
    "trigger": "",
    "range": "30 feet",
    "target": "1 creature",
    "duration": "1 hour",
    "saving": "Will"
}