{
    "url": "https://2e.aonprd.com/Spells.aspx?ID=323",
    "name": "Summon Fiend",
    "source": "Core Rulebook",
    "traditions": [
        "Divine"
    ],
    "rarity": "Common",
    "traits": [
        "Conjuration"
    ],
    "cantrip": false,
    "focus": false,
    "level": 5,
    "summary": "Conjure a fiend to fight on your behalf.",
    "heightenable": true,
    "description": "You conjure a fiend to fight on your behalf. This works like summon animal, except you summon a common creature that has the fiend trait and whose level is 5 or lower, such as those below. You can't summon a creature unless its alignment is one of your deity's preferred alignments (or, if you don't have a deity, is within one step of your alignment). At the GM's discretion, some deities might restrict specific types of fiends, even if their alignments match.\n\n------\n\nHeightened (6th) Level 7.\nHeightened (7th) Level 9.\nHeightened (8th) Level 11.\nHeightened (9th) Level 13.\nHeightened (10th) Level 15.\nLevel 0 FiendsLemure (LE)Level 1 FiendsAugur (LE), Cacodaemon (NE), Doru (LE), Esipil (NE), Imp (LE), Ostovite (CE), Quasit (CE), Shaukeen (LE)Level 2 FiendsDretch (CE)Level 3 FiendsHell Hound (LE), Vermlek (CE), Yeth Hound (CE), Zebub (LE)Level 4 FiendsAbrikandilu (CE), Aghash (LE), Barghest (CE), Nucol (NE)Level 5 FiendsBarbazu (LE), Brimorak (CE), Dandasuka (LE), Karina (NE), Ostiarius (LE)Level 6 FiendsBabau (CE), Ceustodaemon (NE), Evangelist (LE), Nightmare (NE), Wihsaak (NE)Level 7 FiendsAdhukait (LE), Hellcat (LE), Invidiak (CE), Levaloch (LE), Pairaka (LE), Succubus (CE)Level 8 FiendsErinys (LE), Hellwasp Swarm (LE), Nabasu (CE), Onidoshi (LE), Sarglagon (LE)Level 9 FiendsLeukodaemon (NE), Nessian Warhound (LE), Night Hag (NE), Osyluth (LE), Pakalchi (NE), Vrock (CE)Level 10 FiendsBebilith (CE), Kalavakus (CE), Phistophilus (LE), Piscodaemon (NE), Raja Rakshasa (LE), Sacristan (LE), Soul Skelm (LE)Level 11 FiendsGreater Nightmare (NE), Hamatula (LE), Hezrou (CE), Meladaemon (NE), Munagola (LE)Level 12 FiendsDerghodaemon (NE), Interlocutor (LE), Japalisura (LE)Level 13 FiendsGelugon (LE), Glabrezu (CE), Ice Yai (CE), Thanadaemon (NE)Level 14 FiendsChakanaj (NE), Fire Yai (LE), Gylou (LE), Nalfeshnee (CE), Nikaramsa (LE), Sepid (LE)Level 15 FiendsCrucidaemon (NE), Taiga Yai (NE)",
    "economy": "3-action",
    "components": [
        "Somatic",
        "Verbal",
        "Material"
    ],
    "trigger": "",
    "range": "30 feet",
    "target": "",
    "duration": "sustained up to 1 minute",
    "saving": ""
}