{
    "url": "https://2e.aonprd.com/Spells.aspx?ID=1007",
    "name": "Summon Deific Herald",
    "source": "Secrets of Magic",
    "traditions": [
        "Divine"
    ],
    "rarity": "Common",
    "traits": [
        "Conjuration",
        "Incarnate"
    ],
    "cantrip": false,
    "focus": false,
    "level": 8,
    "summary": "Summon an incarnate representative of your deity, with effects depending on alignment.",
    "heightenable": false,
    "description": "Your faith is strong enough to briefly summon a direct representative of your deity, such as the deity's herald. The herald occupies the space of a Huge creature and has a Speed of 60 feet. The effects of this spell depend on your deity's alignment.Lawful Good: Arrive (enchantment, good, lawful) Aura of Retribution While within 100 feet of the herald, you and your allies gain the champion's Retributive Strike reaction; Depart Holy Smite The herald casts 5th-level divine wrath (choosing good) in a 100-foot emanation.Neutral Good: Arrive (enchantment, good) Aura of Redemption While within 100 feet of the herald, you and your allies gain the champion's Glimpse of Redemption reaction; Depart Merciful Healing The herald casts the 3-action version of 5th-level heal with a radius of 100 feet. This spell targets only you and your allies.Chaotic Good: Arrive (chaotic, enchantment, good) Aura of Liberation While within 100 feet of the herald, you and your allies gain the champion's Liberating Step reaction; Depart Radiating Freedom The herald affects you and all your allies within 100 feet with freedom of movement. The duration is reduced to 3 rounds.Lawful Neutral: Arrive (abjuration, lawful) Defy Chaos You and each ally within 100 feet of the herald gain resistance 20 against chaotic damage while the herald is present; Depart Order's Wrath The herald casts 5th-level divine wrath (choosing lawful) in a 100-foot emanation.Neutral: Arrive (transmutation) Quickening Ripple You and each ally within 100 feet of the herald are quickened while the herald is present, and can use the additional action to Step, Stride, or Strike; Depart Sapping Beam The herald casts 6th-level enervation in a 100-foot line.Chaotic Neutral: Arrive (abjuration, chaotic) Defy Law You and each ally within 100 feet of the herald gain resistance 20 against lawful damage while the herald is present; Depart Chaos Hammer The herald casts 5th-level divine wrath (choosing chaotic) in a 100-foot emanation.Lawful Evil: Arrive Aura of Iron While within 100 feet of the herald, you and your allies gain the champion's Iron Command reaction; Depart Unholy Blight The herald casts 5th-level divine wrath (choosing evil) in a 100-foot emanation.Neutral Evil: Arrive Aura of Selfishness While within 100 feet of the herald, you and your allies gain the champion's Selfish Shield reaction; Depart Infinite Despair The herald casts 5th-level crushing despair in a 100-foot cone.Chaotic Evil: Arrive Aura of Vengeance While within 100 feet of the herald, you and your allies gain the champion's Destructive Vengeance reaction; Depart Weapon Hurricane The herald casts 5th-level weapon storm in a 100-foot cone, using d12 for the die size.",
    "economy": "3-action",
    "components": [
        "Somatic",
        "Verbal",
        "Material"
    ],
    "trigger": "",
    "range": "100 feet",
    "target": "",
    "duration": "until the end of your next turn",
    "saving": ""
}